{
  "version": "https://jsonfeed.org/version/1",
  "title": "dgls | blog",
  "home_page_url": "https://dgls.dev",
  "feed_url": "https://dglsparsons.github.io/feed/feed.json",
  "description": "I&#39;m a developer working at Shamaazi on products that help over 160,000 people give to charity. Keep up to date with my thoughts and opinions on my blog!",
  "author": {
    "name": "Douglas Parsons",
    "url": ""
  },
  "items": [{
      "id": "https://dgls.dev/posts/formula-1-pistons/",
      "url": "https://dgls.dev/posts/formula-1-pistons/",
      "title": "Tolerances: How Formula 1 pistons can teach us to be better developers",
      "content_html": "<p>Recently, while procrastinating from work, I found myself watching a youtube video on <a href=\"https://www.youtube.com/watch?v=lCEKJxHiEIM\">Formula 1 pistons</a>.</p>\n<p>This video seeks to answer the question: why does a Formula 1 car piston cost around 1,000 times the amount of a typical road car (£50,000 vs £50), despite appearing very similar and serving the same purpose?</p>\n<p><img src=\"/img/remote/pistons.jpg\" alt=\"Whispering\"></p>\n<p><em>Left: piston from an American muscle car. Right: piston from a formula 1 car.</em></p>\n<p>So, what does this teach us about programming, and how to be a better developer?</p>\n<h2>The cost of immaculate tolerances 💰</h2>\n<p>Manufacturing a car piston is a game of playing with tolerances.</p>\n<p>The piston itself has to fit into a cylinder block snugly, with a small gap around the sides to allow it to move freely. If the gap between a piston and the cylinder is too big, then burning fuel can escape, and the piston is far less efficient. If the gap is too small, then the piston can seize up, blocking the engine completely.</p>\n<p><img src=\"/img/remote/piston-cycle.jpg\" alt=\"Piston Cycle\">\n<em>The process a car piston goes through in a single cycle</em></p>\n<p>This adds some serious complexity for building these parts. Not only do they have to be designed to an incredible specification, but the margin for error when manufacturing these parts is so small that they require specialised machinery and special processes to make sure they are fit for purpose.</p>\n<p>Rather than immaculate tolerances, what if we wanted to be able to guarantee the quality of code we write as programmers? Imagine if a single bug in your code would be a catastrophic failure or even a risk to life. Would that change the way you write code? Would it change the way you review and test code? And how do you think that would affect the speed at which you develop?</p>\n<p>No doubt development would be much slower. Just like the creation of pistons for Formula 1, the process would have to become far more thorough. You would need specific tools and processes to guarantee the right results. You would have to change the way you approach writing software to ensure it behaved exactly as you wanted in every possible situation. And, no doubt, the overall cost of developing software would become much greater as a result of these changes.</p>\n<p>When we write software, we have to bear this situation in mind. It’s easy to claim that everything should be of the highest possible quality, but there is a cost for achieving that. Instead, the bar for quality needs to appropriate for the task at hand. Set your tolerances too small, and development becomes slow and expensive. Set them too low, and you end up with inefficient results.</p>\n<h2>Regular oiling and refactoring 🛢️</h2>\n<p>In a typical road car, pistons require a bit of help to slide up and down inside their cylinder block: metal doesn’t slide particularly well over other metal, so a layer of oil makes the whole process much easier. In new cars, this oil is a very thin, watery liquid thanks to a solid manufacturing process of car engines. In classic cars, oil can be thick, black gunge - the difference being the gap between the piston and the cylinder block is much larger, so the oil needs to be much thicker to work across the gap. As Formula 1 cars have such minuscule tolerances, their pistons require no oil at all.</p>\n<p>Now, imagine oiling a car as being like refactoring code.</p>\n<p>What does that mean? Take an old banger of a codebase, and you’ll find yourself having to change the oil regularly. Changing the oil is a messy process that really involves rolling your sleeves up and diving in. It can take time to do, and by the time you’ve managed to do a big refactor, you’re sure everything will be running much smoother as a result, but you find you’re worn out and covered in bits of greasy old oil.</p>\n<p>What about a modern codebase? The oil here is much thinner: development practices have got a lot better and technology has really come a long way. As a result, we don’t have to spend nearly as much time under the bonnet. This is still an important part of our work, though. Much as a car needs a regular oil change, codebases need a regular touch up to keep them running. Don’t keep on top of this maintenance, and you never know when it’ll catch up to you with a bang.</p>\n<p>Finally, imagine our immaculate codebase from earlier, where quality and lack of bugs trumps all. This is the Formula 1 car of the software world. There’s no need for oil, so there’s no need for oil changes. If all the code here is perfect the first time around, why would we ever need to refactor?</p>\n<h2>Closing thoughts 💭</h2>\n<p>If we think of the two practises of managing tolerances or quality, and refactoring code as linked, then we draw some nice conclusions.</p>\n<p>Focussing on tolerances and quality the first time around can lead to a huge increase in upfront cost, both in terms of time and effort. This can net you some neat benefits though. Not only can you guarantee the codebase as bug-free and brilliant, but you end up with code that needs no further work. There’s little to no maintenance cost, and you’ll never find yourself refactoring.</p>\n<p>Conversely, a focus on the low-cost, fast-paced development necessitates a lower tolerance for quality. This can be useful for getting a project into the world, but comes with a cost later down the line: you need regular oil changes and refactoring to keep everything neat, or you risk blowing up with a bang.</p>\n<p>In reality, most codebases lie between these two extremes. Rather than focussing solely on one extreme or the other, we need to be mindful of a balance. Insisting on quality over all else is a tradeoff, and at times isn’t the right one to make. Equally, we need to be careful of the costs down the line in cutting upfront quality. Next time you review a pull-request or submit a new feature, think of this tradeoff: do we mind oiling this a bit later, or do we want an immaculate Formula 1 piston right now?</p>\n",
      "date_published": "2021-01-18T11:00:00+00:00"
    },{
      "id": "https://dgls.dev/posts/never-again/",
      "url": "https://dgls.dev/posts/never-again/",
      "title": "3 popular technologies that I will strive to never use again",
      "content_html": "<p>There are a lot of different technologies out there. More than anyone could possibly explore. The de-facto position is to look for technologies that are popular, following the logic that “if enough people like it, it must be good”.</p>\n<p>In my experience, this isn’t always the case though.</p>\n<p>Throughout my career, I’ve worked across a wide range of technologies. While I’ve grown to love some of them, at times I felt like I was fighting a losing battle and spending more time scrapping with technology rather than solving real-world problems. Whenever this is the case, I make a mental note to avoid that technology in future.</p>\n<p>Here are the three I found the most painful to use.</p>\n<h2>1) Django ⏰</h2>\n<p>Django is a hugely popular framework for developing websites using a model-template-view architectural pattern. It’s amazing for getting something done very quickly. It also comes with a fantastically powerful Object Relational Mapper (ORM). So what’s the problem?</p>\n<p><em>Its opinions are too strong!</em></p>\n<p>If you’re working just with a relational database, and only want model-template-view, and you’re completely fine with containerising and managing your own scaling, then it may be completely fine. When I used it we were updating our architecture though. Our entire workload wasn’t suited to a relational database and we wanted to take more benefit from auto-scaling, lambdas and managed services in AWS. We were also looking to use React to build more complete experiences for our UI. This became a real break-away from the Django core use-cases. As time went on, we began fighting Django’s opinions more and more. Every change became a battle, digging through the documentation and hacking in workarounds. Over time the codebase became scrappier and scrappier.</p>\n<p>Django didn’t feel like the right tool for us. It felt messy and difficult to avoid. If used in its particular setting, it’s probably fine, but it’s not for me.</p>\n<h2>2) Scala 🐌</h2>\n<p>Scala is designed to avoid the pitfalls of Java. It runs on the JVM, allows interop with existing Java code, yet provides a much stronger type system and enables functional paradigms.</p>\n<p>Despite being in many ways an obvious improvement over Java, my experience with the language was not great. There were two main pitfalls I encountered: quirky behaviour and tooling.</p>\n<p>As Scala derives from Java but mixes in functional paradigms, the language contains a huge amount. While being a strength in some ways, parts of Scala have some bizarre hangovers. We’ve all <a href=\"https://www.destroyallsoftware.com/talks/wat\">mocked JavaScript</a> for some of its bizarre and unexpected behaviour in code that looks correct. Scala often takes this to another level. It’s easy to slip up when writing code, and unless you know the language incredibly well, need to constantly be on the lookout for <a href=\"https://nrinaudo.github.io/scala-best-practices/\">common pitfalls</a> (or set up a linter for these).</p>\n<p>The second issue I faced with the language was really poor tooling:</p>\n<ul>\n<li>Getting support in vim (my editor of choice) was a nightmare,</li>\n<li>Automatically formatting code was far more difficult than I expected,</li>\n<li>Finding a lightweight logger that didn’t require a thousand line XML file was impossible,</li>\n<li>Setting up linting rules for all the common language quirks was an exercise in finding unmaintained repositories and configuring XML,</li>\n<li>And, finally, once everything finally worked together, I was stuck battling slow compile times and integration tests that were slower than intercontinental drift.</li>\n</ul>\n<p>For a popular language, I was really surprised. There were bits I loved, but overall the experience was akin to pulling teeth. Not one I’d go in for again!</p>\n<h2>3) Segment 💰</h2>\n<p>Last year, we stumbled across <a href=\"https://segment.com/\">Segment</a>. A fantastic looking tool that drastically reduces the amount of tracking code you need to write. It allows seamless integration into a plethora of different services and seemed to match up precisely with what we wanted. Pricing wise there’s a generous free tier (1,000 Monthly Active Users), and competitive pricing outside of this, or so we thought... Reading around on the internet, it was generally well-received, so we thought we’d give it a try.</p>\n<p>Plugging it into our website was a straightforward experience, and it appeared to deliver on all its promises. We soon had all our events being fired into Segment and tracked across a range of different tools. Brilliant. We put it live.</p>\n<p>The next day, we had a sudden spike in traffic caused by a third-party accidentally scraping us repeatedly. Oops. While the third-party resolved the issue on their site, I logged back in to find out how our Monthly Active User (MAU) allowance had been affected.</p>\n<p><em>It had been completely demolished</em></p>\n<p>Not only had we overshot our MAU limit in a matter of hours, but we’d racked up a substantial bill. It turns out every single anonymous visit to our website was being counted as an additional MAU. Pricing per MAU meant overshooting our limit was expensive. We had to pull the ripcord and tear it out immediately.</p>\n<p>One expensive bill later, that’s a mistake I don’t want to make again.</p>\n<h2>Closing thoughts 💭</h2>\n<p>These three technologies have scarred me as a developer. Having had to fight through difficult situations with each one of them, I know I’ll strive to avoid them in the future. In my experience, Django, Scala and Segment just aren't worth the pain.</p>\n<hr>\n<p>Do you have any technologies you feel the same about? Feel like I’ve missed some out? If so, what are they?</p>\n<hr>\n<p>Think I’m wrong about any of these? Get in touch and let me know.</p>\n",
      "date_published": "2021-01-08T14:45:00+00:00"
    },{
      "id": "https://dgls.dev/posts/creating-challenges/",
      "url": "https://dgls.dev/posts/creating-challenges/",
      "title": "Creating challenges: three ways to improve the technical assessment",
      "content_html": "<p>Through December, I spent a large amount of time doing two things: working my way through the 2020 <a href=\"https://adventofcode.com/\">Advent Of Code</a>; and assessing applications for a job opening we had at Shamaazi. The two initially sound unrelated, but part of our hiring process involves sending candidates an engineering assignment. Similarly, some people use Advent Of Code as <a href=\"https://y3l2n.com/2018/05/09/interview-prep-advent-of-code/\">interview preparation</a>.</p>\n<p>It’s safe to say I spent most of December looking at or thinking about programming challenges 👀</p>\n<p>I’ve been reflecting on ‘what makes a good engineering assessment’, and I’ve come to the conclusion that a good assessment – as part of recruiting – should pay careful attention to three main things.</p>\n<h2>1) Keep it simple, stupid (KISS) 😗</h2>\n<p>If you’re applying for a new programming job, changing career or trying to get your foot onto the ladder, then the chances are you’re applying to a few different companies. Even if you’re just applying to one though, it takes time. Time to write a CV, time to write a cover letter, research the company, send an application, prep for an interview. Engineering assignments are just one more thing that can eat away at your time.</p>\n<p><em>Time is a limited resource.</em></p>\n<p>Expecting candidates to spend hours decrypting sparse instructions, or spend hours going ‘above and beyond’ in implementing a solution just further reduces any free time they would have. Having lengthy tech-assessments, or expecting candidates to devote their lives to you just creates a false barrier to entry. Some of the best developers I know have lives, kids, families or hobbies outside of their jobs. When recruiting, you should look for well-rounded individuals, not just those who <a href=\"https://dgls.dev/posts/three-unique-qualities/\">live and breathe software development</a>.</p>\n<p>So instead, let’s keep Tech Assessments short. Not simple, but short – short enough that they can be done in a small amount of time. Short so the instructions are easy to wrap your head around. Short so you don’t feel like you have to work all weekend just for a chance at an interview. Because let’s face it, nobody wants that.</p>\n<h2>2) Make sure it’s explicitly clear what you’re looking for 👀</h2>\n<p>Recently, I had a friend apply to a new job. He’s a fantastic engineer, works incredibly hard, comes up with brilliant ideas and really contributes towards creating a fun-loving, happy culture. In my eyes, he’s exactly the sort of developer you would want to work with.</p>\n<p>As part of applying to a new job, he was asked to complete a short technical assessment. Nothing out of the ordinary here – he completed it pretty quickly and sent it over to me to check through. Together we checked through it and came away happy. It was a really neatly organised, clean and efficient solution to the problem he was given. So he submitted it.</p>\n<p>A week went by. <em>No response.</em></p>\n<p>Another week went by. <em>No response.</em></p>\n<p>By this point, he began to get agitated. Maybe they had missed his email, maybe they had forgotten to look at his solution? Maybe the person intended to review it was on leave?</p>\n<p>So he reached out to them, expressing his concerns, wondering what had happened. Why had he got no reply? They emailed him back a simple, short answer:</p>\n<p><em>”your submission, while solving the given solution, did not go above and beyond and as a result, was not what we were looking for</em>”</p>\n<p>He told me this, and I was immediately outraged. How could they be so stupid to pass up on a talented engineer? Why would they want their engineers to show terrible self-control, to be constantly going off-piste? After some reflection, I realised the problem wasn’t just that they were looking for the wrong characteristics in their developers, but that they had never made it clear in their assignment what they wanted you to do. If they didn’t really care about the solution to the problem, but what you did above and beyond that, then why didn’t they say so?</p>\n<p>So instead, let’s keep it explicitly clear what qualities we wish people to display, what areas they should focus on, and make sure it’s crystal clear what they should do. Communication, after all, is a <a href=\"https://dgls.dev/posts/communication/\">key skill</a>.</p>\n<h2>3) Make sure the challenge is representative 🏁</h2>\n<p>It’s very easy to forget when you’re screening candidates and reviewing tech assessments, but every single part of the recruitment process communicates what it’s like to work at a company. Job descriptions give a clear indication of the role, invitation emails should give a bit of a sense of the people who work at a company. Equally, a technical assessment should give an indication of the type of work you will be doing.</p>\n<p>If an assignment is all about React hooks, then that’s a strong indication I’ll both need to learn React, and that I’d be writing a tonne of React at that job.</p>\n<p><em>Sounds obvious, right?</em></p>\n<p>But people seem to forget this. Instead, they focus on <a href=\"https://hackernoon.com/50-data-structure-and-algorithms-interview-questions-for-programmers-b4b1ac61f5b0\">obscure algorithms</a>, copy-pasted katas, or completing contrived challenges –like Advent of Code, fun as it is.</p>\n<p>So instead, let’s make technical assessments relevant. Rather than reaching for an obscure problem, what’s the most recent, complicated piece of code you had to write, or edit, or maintain? Can that be explained in a short brief? If so, let’s use that instead.</p>\n<h2>Closing thoughts 💭</h2>\n<p>Technical challenges are an incredibly useful tool to use as part of the hiring process. They can often give a much better indication of a candidate than any amount of phone screening, whiteboard-quizzing, or CV scrutinising can. But we have to be careful with them.</p>\n<p>Through creating representative challenges, keeping technical assessments lightweight and mindful of time, and by making it explicitly clear what qualities a good candidate would show, we can create technical assessments that don’t feel irrelevant, don’t feel like a time-drain, and are much more useful to both the assessor and the assessee.</p>\n<hr>\n<p>Want to know more of my thoughts on recruitment? Read about the <a href=\"https://dgls.dev/posts/three-unique-qualities/\">qualities I believe developers should show</a></p>\n<hr>\n<p>Do you want to know more about the problems people have in technical assessments? Would you like to know how to avoid these pitfalls when completing a technical assessment? Please <a href=\"https://twitter.com/dglsparsons\">get in touch</a> and let me know.</p>\n",
      "date_published": "2020-12-30T18:45:00+00:00"
    },{
      "id": "https://dgls.dev/posts/testing-is-important/",
      "url": "https://dgls.dev/posts/testing-is-important/",
      "title": "Testing is important: three ways to easily improve test quality",
      "content_html": "<p>It’s no secret that testing is important. We rely on tests to describe intended behaviour, catch any subtle bugs and prevent regressions in our code. But why are tests always such a pain to write well? In mature codebases tests quickly become convoluted and, in my experience, testing is one of the most challenging aspects of software engineering.</p>\n<p>This is because we don’t hold our tests – unit tests, integration tests, end-to-end tests or smoke-tests – to the same standards production code. Poor testing can make a codebase even more difficult to maintain than having no tests at all. Despite this, good testing practice flies under the radar and is easily neglected.</p>\n<p>Let's challenge this and look at three qualities we expect of good production code, and apply this same thinking to test code – where such quality control is often absent.</p>\n<h2>1) Don’t Repeat Yourself (DRY) 🔁</h2>\n<p>People are obsessed with DRY when it comes to production code, often taking it <a href=\"https://dev.to/wuz/stop-trying-to-be-so-dry-instead-write-everything-twice-wet-5g33\">too far</a>. This same anti-repeating is rarely applied to tests. Instead, testing becomes a haven for duplication, with information copied all-over the place. This is most prevalent in two forms.</p>\n<ul>\n<li><strong>Asserting</strong> – Often there are a tonne of very similar tests, copy pasted with minor tweaks. In reality, they often cover the same test case, with the rationale that it’s “making extra sure”.</li>\n<li><strong>Setup</strong> – Some tests require laborious setup. Creating mock users, seeding test-data and making sure any dependencies are stubbed out. This setup often gets duplicated between tests or test-suites, with only minor tweaks.</li>\n</ul>\n<p>Duplicating assertions and setup both have the same knock-on impact. Bug-fixes, feature tweaks or refactoring quickly becomes a headache. Instead of being able to make a simple modification, a change becomes a game of whack-a-mole, wading through duplicated logic with seemingly unrelated tests starting to fail. You then notice some mocks are wrong, some tests don’t even work. We end up feeling like we need a sledgehammer rather than a scalpel.</p>\n<p>Dave Cheney published a brilliant micro-blog on this very topic - you should definitely <a href=\"https://dave.cheney.net/2020/12/15/the-story-of-the-one-line-fix\">check it out</a>. It summarises the mentality behind most duplication far better than I can.</p>\n<h2>2) Scrutinize tests the same as any other code 🔍</h2>\n<p>I recently <a href=\"https://dgls.dev/posts/avoid-utils/\">wrote a post on</a> one of the larger projects I’ve worked on during my career. This project, despite having some talented engineers working on it, was a complete mess. In particular, let's talk about code reviews and tests.</p>\n<p>We all worked in the same physical office, so pull-requests were usually reviewed face-to-face.</p>\n<p>This was great and worked really well – it was much easier to have open discussions, loop in people who should be involved, or to get answers to questions. I once overheard a discussion over a pull-request between two experienced developers. Their conversation bounced around discussing sensible topics – the high-level approach to solving a problem, justifying the design and making sure it was efficient. They then delved into the low-level, technical details – making suggestions for improving variables names, neatening up some abstractions, adhering to best practices and agreed standards.</p>\n<p>Then it came to <s>reviewing</s> the tests.</p>\n<p><em>&quot;Yeah, it has tests&quot;</em> said one engineer to the other. <em>&quot;Do they pass?&quot;</em>, the second questioned. <em>&quot;Yes&quot;</em>, replied the first. <em>&quot;That's good&quot;</em>, confirmed the second, as both engineers sat nodding to each other as they absent-mindedly scrolled through several hundred lines of tests.</p>\n<p>Let's look at the real problem here: the measure of quality had nothing to do with the tests, beyond them simply existing and passing. There was no discussion around edge cases. Were they testing the right things? Was the generation of the test data suitable? Did they take the right approach to mocking? Did the tests even accurately describe what they're doing.</p>\n<p>It came to no surprise to anyone, certainly myself, that the majority of tests on the project were useless. Needlessly so, too. By asking simple questions and caring enough to review the tests properly, they could have saved hours of work later down the line, for the sake of five minutes now.</p>\n<h2>3) Avoid mocking integrations in integration tests 🔗</h2>\n<p>It sounds obvious when it’s written out like that, right? But you’d be amazed how often this happens. Consider that we are writing a function responsible for adding new users to a mailing list for a product. A test for this might look like the following:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token function\">describe</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"mailing list list\"</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token function\">beforeEach</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    jest<span class=\"token punctuation\">.</span><span class=\"token function\">spyOn</span><span class=\"token punctuation\">(</span>emailStorage<span class=\"token punctuation\">,</span> <span class=\"token string\">\"save\"</span><span class=\"token punctuation\">)</span><br>    jest<span class=\"token punctuation\">.</span><span class=\"token function\">spyOn</span><span class=\"token punctuation\">(</span>emailStorage<span class=\"token punctuation\">,</span> <span class=\"token string\">\"rollback\"</span><span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token function\">it</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"should add an email to a mailing list\"</span><span class=\"token punctuation\">,</span> <span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">const</span> email <span class=\"token operator\">=</span> <span class=\"token function\">mockEmail</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br><br>    <span class=\"token keyword\">const</span> response <span class=\"token operator\">=</span> <span class=\"token keyword\">await</span> mailingList<span class=\"token punctuation\">.</span><span class=\"token function\">addEmail</span><span class=\"token punctuation\">(</span>email<span class=\"token punctuation\">)</span><br><br>    <span class=\"token function\">expect</span><span class=\"token punctuation\">(</span>response<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">toEqual</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">{</span><br>      email<span class=\"token operator\">:</span> email<span class=\"token punctuation\">,</span><br>      subscribed<span class=\"token operator\">:</span> <span class=\"token boolean\">true</span><br>    <span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">expect</span><span class=\"token punctuation\">(</span>emailStorage<span class=\"token punctuation\">.</span>save<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">toHaveBeenCalledTimes</span><span class=\"token punctuation\">(</span><span class=\"token number\">1</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">expect</span><span class=\"token punctuation\">(</span>emailStorage<span class=\"token punctuation\">.</span>rollback<span class=\"token punctuation\">)</span><span class=\"token punctuation\">.</span><span class=\"token function\">toNotHaveBeenCalled</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span></code></pre>\n<p>This looks fairly typical, right? Although you could say that’s a lot of mocking for one test. It prompts the question:</p>\n<p><em>“What are we actually testing here?”</em></p>\n<p>Are we <em>unit</em> testing the logic the function contains? Or are we testing that it <em>integrates</em> properly with the email storage?</p>\n<p>If it's a unit test, you’d argue to mock as much as you can so you are just testing the logic.  We seem to be asserting on the mocks a lot though, which wouldn’t be the case if we weren’t also testing the integration.</p>\n<p>In this case, how useful really is this test? It’s attempting to test an integration by integrating with a mock. This test looks a lot like it’s not really testing any behaviour at all - it’s just checking that the code does what the code does, at the same level of abstraction.</p>\n<p>Say for example, that the email storage didn’t behave the way we expected it to. Would this test fail? Should this test fail? If we rewrote the test to use the real email storage, and then tested it worked in reality, would this be more valuable?</p>\n<h2>Closing Remarks 💬</h2>\n<p>Tests are just more code. More code that you should treat with the same level of respect as any other code. Write them well, and they can be a powerful asset that help you safely refactor and add new features. Write them poorly, and they will quickly become a burden. Every change you make becomes wading through mud, sledgehammer in hand. We must think carefully how to write our tests, and be as meticulous with testing as we are with the rest of our code. Unless we do this, tests are a nightmare.</p>\n",
      "date_published": "2020-12-18T14:30:00+00:00"
    },{
      "id": "https://dgls.dev/posts/three-unique-qualities/",
      "url": "https://dgls.dev/posts/three-unique-qualities/",
      "title": "Three unusual qualities we look for to hire amazing developers",
      "content_html": "<p>Here at Shamaazi, we’ve recently gone through a round of hiring… and wow, hiring is hard!</p>\n<p>It’s challenging finding engineers who have the right qualities, attitude and personality to join a team. We’re a <strong>tiny</strong> company, with just 2 engineers, so any new teammates have a massive impact on our products and culture.</p>\n<p>We’re super careful about who we hire because of this.</p>\n<p>We don’t expect or search for rockstar developers who can recite algorithms and live and breath software. We don’t expect the world’s most qualified experts in the technology we use. We don’t expect people to spend every moment of their spare time programming.</p>\n<p>The qualities we do look for are probably considered unusual compared to most software engineering outfits. Let's take a look at the three we use to ensure a good fit for working at Shamaazi.</p>\n<h2>Eagle-eyed attention to detail 🔍</h2>\n<p>We give our potential candidates a short engineering assignment as part of our hiring process. We explicitly request that they don't spend more than an hour on it, but it still gives us a vast amount of information that just simply isn't evident from their CV.</p>\n<p>Reviewing these assignments has been eye-opening. Most solutions lack attention to detail in at least one area. We begin by asking relatively simple questions of the submissions:</p>\n<ul>\n<li><strong>Correctness</strong> – does the solution work for all inputs?</li>\n<li><strong>Validation</strong> – are the inputs validated, what happens if we try to break the system?</li>\n<li><strong>Testing</strong> – How do we know their solution is correct? Is there any proof that it reliably works?</li>\n<li><strong>Quality</strong> – How easy is their solution to understand, maintain or extend?</li>\n</ul>\n<p>Most technical tests we’ve seen fail on at least two or three of these, if not all four. Quite simply, they lack attention to detail in both their quality and behaviour.</p>\n<p>This lack of attention to detail also applies to CVs. We’ve seen poor grammar, typos and even sentences that don’t make sense! Quite frankly, if they can’t complete a short assignment with rigour, or can’t write a CV without errors, can we really trust them with a product that could shape the future of our company?</p>\n<h2>The ability to express clearly 🗣️</h2>\n<p>Writing good code, a good CV, or writing prose all have a lot in common. They are all forms of <a href=\"https://dgls.dev/posts/communication/\">communication</a>.</p>\n<p>Writing good code is about communicating a set of requirements both to the computer, and to a future maintainer, CVs communicate your skills and knowledge to a potential employer, and prose is a form of communicating ideas by writing them down.</p>\n<p>As a result, the ability to express yourself clearly is super important. Engineering teams don’t work in isolation, and working remotely causes a whole new set of challenges for communication. In order to stay well-aligned, agile, and have the ability to discuss complicated topics, we communicate constantly as a team. This is a fundamental aspect of a team being <a href=\"https://timreview.ca/article/567\">high-performing</a>.</p>\n<p>So, when reviewing engineers, we have to consider a few key questions:\nDoes their code communicate its purpose clearly? Is it well structured? Well written? Does it clearly separate concerns? Does it have sensible naming?\nDoes their CV communicate their strengths and experience eloquently and concisely?\nWhen prompted in an interview, can a candidate clearly express their thought-process? Can they articulate complicated ideas?</p>\n<p>If the answer to all of these is ‘yes’, then we know we have a candidate who is going to be a delight to work with.</p>\n<h2>A positive outlook 😄</h2>\n<p>This one sounds strange, but I was first introduced to the idea by Patrick Collison, the Founder and CEO of Stripe. In his excellent talk <a href=\"https://www.youtube.com/watch?v=fPfYN5gU_C0\">‘How to Scale’</a>, Patrick discusses in great depth the difficulties in building the culture he wanted.</p>\n<p>At an ideal company, we would go to work and everyone would be happy. People would love their jobs and be enthusiastic and supportive. The question then becomes: ‘how do we create a company where this is the culture? Where the atmosphere is happy’. This is an incredible challenge, one that has no easy solution.</p>\n<p>As a side note, if anyone knows how to build a company that can turn unhappy people into happy ones, please let me know (I’d like to send my parents there)!</p>\n<p>Thankfully, Patrick Collison also shared his ‘cheat’ to achieve this. Simply hire people who are happy, positive people already. This is the culture we want to build, so we’re taking the same shortcut he did at Stripe. By hiring happy people, we can ensure we maintain a happy culture.</p>\n<h2>Closing Thoughts</h2>\n<p>As a tiny company, we have to be incredibly careful about the people we hire. They can have a massive impact on our products, for better or for worse, and contribute heavily towards our culture. Because of this, we deliberately look for these three qualities as signs of excellence in people.</p>\n<p>If we can find people to hire who show three key qualities: a happy outlook, the ability to express themselves clearly, and a keen eye for details, then we know they will be a brilliant hire.</p>\n<hr>\n<p>Would you like to hear more about our hiring process? Do you want to know more about the problems people have in our technical assessment, or the common errors on CVs? Get in touch and let me know.</p>\n<hr>\n<p>Enjoyed this post? Want to share your thoughts on the matter? Found this article helpful? Disagree with me? Let me know by <a href=\"twitter.com/dglsparsons\">messaging me on Twitter</a>.</p>\n",
      "date_published": "2020-12-11T12:00:00+00:00"
    },{
      "id": "https://dgls.dev/posts/avoid-utils/",
      "url": "https://dgls.dev/posts/avoid-utils/",
      "title": "Don&#39;t Write Utils: how to become an amazing programmer by naming carefully",
      "content_html": "<p>I hate the word ‘utility’. It says absolutely nothing. And yet, I come across it in so often when programming. It can take different guises too: ‘common’, ‘shared’, ‘lib’, ‘pkg’, ‘tools’, etc. These names can appear both as filenames or as directory names and drive me insane when they do.</p>\n<p>Why?</p>\n<p>They can contain literally anything.</p>\n<p>And yet any code that ends up in these places has a clear purpose. It must be useful, otherwise, why would we write this code? I mean, some people do enjoy writing <a href=\"https://github.com/EnterpriseQualityCoding/FizzBuzzEnterpriseEdition\">useless</a> <a href=\"http://www.muppetlabs.com/~breadbox/bf/\">code</a>... but most of the time this isn’t the case. So why do utils crop up everywhere? How do we avoid this problem in our own code? Why does the name utils trigger me? Let me tell you my story.</p>\n<h2>The intent behind a bad name</h2>\n<p>When I first started my career in software engineering, I worked on a large project for NHS Digital. The project involved a variety of products that all shared libraries and packages. The source for these products and packages was a single monorepo, supported by around 30 developers. One ticket on the backlog that I picked up was to refactor a database client shared across these products.</p>\n<p>I began by researching the database clients the products currently used. I painstakingly mapped out an upgrade path for each product. I worked through all common scenarios for the database client. I deliberately designed the minimal interface this database client would need. In my eyes, it was going to be a work of art. Perfection.</p>\n<p>I set about building the database client and after endless weeks of meticulous upgrades, I finally had the finished product. My masterpiece. The code ran like clockwork.</p>\n<h2>The downfall</h2>\n<p>A year later I returned to work on the same codebase to find everything had become a mess. It felt like a rats nest to work in. There was no separation of concerns and every pull-request felt like you were wading through mud. I tried to figure out what the problem was. What had changed? Why had it all gone wrong? After a while, I realised it was entirely my fault.</p>\n<p>When I introduced the database client to the codebase, I’d put it into a <code>/shared/database/</code> directory. Sounds sensible, right? It was going to be shared across all the products, so that would be the logical place to put it. My flaw though was in creating that <code>/shared/</code> directory.</p>\n<p>This shared directory triggered a rapid descent into chaos. Any code that could be conceived as potentially reusable was immediately placed into the shared directory without any consideration. More and more of the logic of each product ended up here, and less and less in the product’s directory. Changes risked breaking everything. It wasn’t long before some of the shared code became product-specific, or became a spiral of self-consuming code with no clear interface.</p>\n<p>Making a change to the shared code either meant changing every caller, overloading the behaviour, or making slightly different variations of the same code. Searching the codebase became near-impossible, duplication began to run rife and separation of concerns was non-existent. It was a nightmare.</p>\n<h2>So what did I learn from this?</h2>\n<p>In creating a shared directory, I’d opened the floodgates. The problem with the name ‘shared’ is that it does not describe the code I had written. It only describes my intent for that code. Code being reused, or shared, is incredibly common. Utility code, shared code, library code, package code. These names are all to do with intent, rather than describing what the code is. I should have stuck to putting my code in a <code>database/</code> directory. Forget the shared part.</p>\n<p>So, what have we learned? We shouldn't call shared code shared, or utils, or common. It should just be code: named for what it is.</p>\n",
      "date_published": "2020-12-01T15:05:00+00:00"
    },{
      "id": "https://dgls.dev/posts/3-amazing-react-hooks/",
      "url": "https://dgls.dev/posts/3-amazing-react-hooks/",
      "title": "3 amazing REACT HOOKS to keep your code organized neatly",
      "content_html": "<p>Hi, my name is Doug. I’ve been a developer for several years and now work as the Lead Engineer at Shamaazi. Over this period of time, I have written a lot of different UIs and learned a lot of ways to structure React code.</p>\n<p>This week I wanted to share my experience of the custom React Hooks I have found the most useful for producing websites in the cleanest, simplest way possible.</p>\n<h2>React Hooks</h2>\n<p>Hooks were first introduced to React in version 16.8, after being teased in 2018. There’s a fantastic guide introducing them on the <a href=\"https://reactjs.org/docs/hooks-intro.html\">React website</a>. Simply stated, they are a way to write side-effects for functional UI components. This allows you to write parts of your UI as JavaScript functions, but still have the ability to manage state, call APIs, use storage, authenticate users, and so on.</p>\n<p>React provides some hooks out of the box (<code>useState</code>, <code>useEffect</code> and <code>useContext</code> being the main three). On top of this, it allows you to compose your own higher-level hooks to separate out reusable logic. These custom hooks are what I’ll explore here. Here are the three I’ve found the most useful across the range of products we produce at Shamaazi.</p>\n<h2>Performing Asynchronous Actions</h2>\n<p>Most websites have to perform some form of asynchronous actions, whether it is loading data to display on the page or submitting data based on a user’s input and actions. It’s helpful to keep a track of the status of these asynchronous actions; is it currently loading? has it returned a result? Was there an error?</p>\n<p>We found a lot of our components started sharing a lot of similar code, either for fetching data on an initial load or for submitting data. This looked like the following:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">const</span> <span class=\"token function-variable function\">MyComponent</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>loading<span class=\"token punctuation\">,</span> setLoading<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">false</span><span class=\"token punctuation\">)</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>error<span class=\"token punctuation\">,</span> setError<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>result<span class=\"token punctuation\">,</span> setResult<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token function\">useEffect</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token function\">setResult</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">setError</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">setLoading</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">true</span><span class=\"token punctuation\">)</span><br>    <span class=\"token keyword\">try</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">const</span> result <span class=\"token operator\">=</span> <span class=\"token function\">doSomeAction</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br>      <span class=\"token function\">setResult</span><span class=\"token punctuation\">(</span>result<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">catch</span> <span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token function\">setError</span><span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">finally</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token function\">setLoading</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">false</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>loading<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span>loading<span class=\"token operator\">...</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>error<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span>something broke<span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span><span class=\"token punctuation\">{</span>result<span class=\"token punctuation\">}</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>All this loading and error logic can be pulled into a hook, making our interface much neater.</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">const</span> <span class=\"token function-variable function\">MyTidyComponent</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">{</span>loading<span class=\"token punctuation\">,</span> result<span class=\"token punctuation\">,</span> error<span class=\"token punctuation\">}</span> <span class=\"token operator\">=</span> <span class=\"token function\">useAsync</span><span class=\"token punctuation\">(</span>doSomeAction<span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>loading<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span>loading<span class=\"token operator\">...</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>error<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span>something broke<span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span><span class=\"token punctuation\">{</span>result<span class=\"token punctuation\">}</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>This <code>useAsync</code> hook is responsible for managing the loading, error and result states, removing the need for all this logic within the actual component. It also lets us reuse this throughout our application. This massively simplifies loading data onto a page.</p>\n<p>As a bonus, we found we also wanted the ability to execute an action later, rather than just when the component is created. This is useful for performing asynchronous actions based on a user's input; actions like submitting a form can use the same hook but pass a <code>false</code> value as a second parameter. This indicates that they don’t want the action to be executed straight away.</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">const</span> <span class=\"token punctuation\">{</span> execute<span class=\"token punctuation\">,</span> loading<span class=\"token punctuation\">,</span> result<span class=\"token punctuation\">,</span> error <span class=\"token punctuation\">}</span> <span class=\"token operator\">=</span> <span class=\"token function\">useAsync</span><span class=\"token punctuation\">(</span>submitSomeForm<span class=\"token punctuation\">,</span> <span class=\"token boolean\">false</span><span class=\"token punctuation\">)</span><br><br><span class=\"token operator\">&lt;</span>form onSubmit<span class=\"token operator\">=</span><span class=\"token punctuation\">{</span>execute<span class=\"token punctuation\">}</span><span class=\"token operator\">></span><br>  <span class=\"token operator\">...</span><br><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span>form<span class=\"token operator\">></span></code></pre>\n<p>We also found that the hook sometimes caused a memory leak if a form submission navigated away from the component (e.g. a form might take you to the next page when it is submitted, but setting <code>loading</code> to <code>false</code> after you’ve been taken away from the form is a memory leak). We’ve handled this by tracking whether the hook is mounted on the page (tracked through <code>useRef</code>). We’ll only update any state if the component is still present. This avoids any memory leaks.</p>\n<p>The full version of our <code>useAsync</code> hook is here:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">import</span> <span class=\"token punctuation\">{</span> useEffect<span class=\"token punctuation\">,</span> useState<span class=\"token punctuation\">,</span> useCallback<span class=\"token punctuation\">,</span> useRef <span class=\"token punctuation\">}</span> <span class=\"token keyword\">from</span> <span class=\"token string\">'react'</span><br><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">default</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\">asyncFunction<span class=\"token punctuation\">,</span> immediate <span class=\"token operator\">=</span> <span class=\"token boolean\">true</span></span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>loading<span class=\"token punctuation\">,</span> setLoading<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">false</span><span class=\"token punctuation\">)</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>result<span class=\"token punctuation\">,</span> setResult<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>error<span class=\"token punctuation\">,</span> setError<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token comment\">// Track a reference to whether the useAsync is actually on a mounted component.</span><br>  <span class=\"token comment\">// useEffect below returns a cleanup that sets this to false. Before setting</span><br>  <span class=\"token comment\">// any state, we check if the cleanup has run. If it has, don't update the state.</span><br>  <span class=\"token keyword\">const</span> mounted <span class=\"token operator\">=</span> <span class=\"token function\">useRef</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">true</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token function\">useEffect</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>      mounted<span class=\"token punctuation\">.</span>current <span class=\"token operator\">=</span> <span class=\"token boolean\">false</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">const</span> execute <span class=\"token operator\">=</span> <span class=\"token function\">useCallback</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\"><span class=\"token operator\">...</span>args</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token function\">setLoading</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">true</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">setResult</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">setError</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>    <span class=\"token keyword\">try</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">const</span> r <span class=\"token operator\">=</span> <span class=\"token keyword\">await</span> <span class=\"token function\">asyncFunction</span><span class=\"token punctuation\">(</span><span class=\"token operator\">...</span>args<span class=\"token punctuation\">)</span><br>      <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>mounted<span class=\"token punctuation\">.</span>current<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>        <span class=\"token function\">setResult</span><span class=\"token punctuation\">(</span>r<span class=\"token punctuation\">)</span><br>      <span class=\"token punctuation\">}</span><br>      <span class=\"token keyword\">return</span> r<br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">catch</span> <span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>mounted<span class=\"token punctuation\">.</span>current<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>        <span class=\"token function\">setError</span><span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span><br>      <span class=\"token punctuation\">}</span><br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">finally</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>mounted<span class=\"token punctuation\">.</span>current<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>        <span class=\"token function\">setLoading</span><span class=\"token punctuation\">(</span><span class=\"token boolean\">false</span><span class=\"token punctuation\">)</span><br>      <span class=\"token punctuation\">}</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span>asyncFunction<span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token function\">useEffect</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>immediate<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token function\">execute</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span>execute<span class=\"token punctuation\">,</span> immediate<span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token punctuation\">{</span> execute<span class=\"token punctuation\">,</span> loading<span class=\"token punctuation\">,</span> result<span class=\"token punctuation\">,</span> error <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span></code></pre>\n<h2>Updating LocalStorage or SessionStorage</h2>\n<p>As part of some of our products, we populate a 'shopping basket'. This keeps a track of what a user has been doing. Sometimes, we want this to persist even if they navigate away from our site, refresh the page, or close the browser. To achieve this, we use a combination of <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/localStorage\">localStorage</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Window/sessionStorage\">sessionStorage</a></p>\n<p>React itself doesn't provide any hooks for storing data in <code>localStorage</code> or <code>sessionStorage</code>, but we wanted a consistent experience with <code>useState</code>. Realistically, it shouldn't be any harder to use <code>localStorage</code> than it would be to use state normally.</p>\n<p>For example, we might want to use <code>localStorage</code> to keep track of a user's input.</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">const</span> <span class=\"token function-variable function\">storageComponent</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>value<span class=\"token punctuation\">,</span> setValue<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useLocalStorage</span><span class=\"token punctuation\">(</span><span class=\"token string\">'storage_key'</span><span class=\"token punctuation\">,</span> <span class=\"token string\">'default_value'</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span>input value<span class=\"token operator\">=</span><span class=\"token punctuation\">{</span>value<span class=\"token punctuation\">}</span> onChange<span class=\"token operator\">=</span><span class=\"token punctuation\">{</span><span class=\"token parameter\">e</span> <span class=\"token operator\">=></span> <span class=\"token function\">setValue</span><span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">.</span>target<span class=\"token punctuation\">.</span>value<span class=\"token punctuation\">}</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>Our hooks to achieve this look like the following:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">const</span> <span class=\"token function-variable function\">useStorage</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\">key<span class=\"token punctuation\">,</span> initialValue<span class=\"token punctuation\">,</span> storage</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token comment\">// Pass initial state function to useState so logic is only executed once</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>storedValue<span class=\"token punctuation\">,</span> setStoredValue<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">try</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">const</span> item <span class=\"token operator\">=</span> storage<span class=\"token punctuation\">.</span><span class=\"token function\">getItem</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">)</span><br>      <span class=\"token keyword\">return</span> item <span class=\"token operator\">?</span> <span class=\"token constant\">JSON</span><span class=\"token punctuation\">.</span><span class=\"token function\">parse</span><span class=\"token punctuation\">(</span>item<span class=\"token punctuation\">)</span> <span class=\"token operator\">:</span> initialValue<br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">catch</span> <span class=\"token punctuation\">(</span>error<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      console<span class=\"token punctuation\">.</span><span class=\"token function\">error</span><span class=\"token punctuation\">(</span>error<span class=\"token punctuation\">)</span><br>      <span class=\"token keyword\">return</span> initialValue<br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token function\">useEffect</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">try</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token comment\">// Update storage every time the value is changed</span><br>      storage<span class=\"token punctuation\">.</span><span class=\"token function\">setItem</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">,</span> <span class=\"token constant\">JSON</span><span class=\"token punctuation\">.</span><span class=\"token function\">stringify</span><span class=\"token punctuation\">(</span>storedValue<span class=\"token punctuation\">)</span><span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">catch</span> <span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      console<span class=\"token punctuation\">.</span><span class=\"token function\">error</span><span class=\"token punctuation\">(</span>e<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span>storedValue<span class=\"token punctuation\">,</span> storage<span class=\"token punctuation\">,</span> key<span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token punctuation\">[</span>storedValue<span class=\"token punctuation\">,</span> setStoredValue<span class=\"token punctuation\">]</span><br><span class=\"token punctuation\">}</span><br><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">const</span> <span class=\"token function-variable function\">useLocalStorage</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\">key<span class=\"token punctuation\">,</span> initialValue</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> <span class=\"token function\">useStorage</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">,</span> initialValue<span class=\"token punctuation\">,</span> window<span class=\"token punctuation\">.</span>localStorage<span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span><br><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">const</span> <span class=\"token function-variable function\">useSessionStorage</span> <span class=\"token operator\">=</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\">key<span class=\"token punctuation\">,</span> initialValue</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> <span class=\"token function\">useStorage</span><span class=\"token punctuation\">(</span>key<span class=\"token punctuation\">,</span> initialValue<span class=\"token punctuation\">,</span> window<span class=\"token punctuation\">.</span>sessionStorage<span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span></code></pre>\n<h2>Authenticating users</h2>\n<p>A super common scenario we've come across is having a bunch of components that all care whether a user is logged in. They often care about acting on the user too, through methods like <code>login</code>, <code>logout</code> or <code>resetPassword</code>.</p>\n<p>In order to keep all these components in sync, we only want a single source of information about the current user. We could do this by having a component wrapping our entire application that manages a <code>user</code> state, and passes any props down to where they are used for the <code>user</code>, <code>login</code>, <code>logout</code> or <code>resetPassword</code> methods.</p>\n<p>This quickly becomes messy though, with many components that don't really care being passed <code>user</code> <code>login</code> and <code>logout</code> props even if they don't use them themselves - only a child of theirs does.</p>\n<p>Luckily React provides the idea of a <a href=\"https://reactjs.org/docs/hooks-reference.html#usecontext\">context</a>. Allowing us to solve this problem.</p>\n<p>We can create an Auth context, and use a hook to get any information from it we want. We can also embed our auth API calls into this context.</p>\n<p>This would look like the following to use:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token comment\">// In our top level App.js</span><br><span class=\"token keyword\">import</span> <span class=\"token punctuation\">{</span> ProvideAuth <span class=\"token punctuation\">}</span> <span class=\"token keyword\">from</span> <span class=\"token string\">'hooks/useAuth'</span><br><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">default</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span>ProvideAuth<span class=\"token operator\">></span><br>    <span class=\"token operator\">&lt;</span>RestOfApplication<span class=\"token operator\">/</span><span class=\"token operator\">></span><br>    <span class=\"token operator\">...</span><br>  <span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span>ProvideAuth<span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span></code></pre>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token comment\">// in a component that wants to use Auth</span><br><span class=\"token keyword\">import</span> useAuth <span class=\"token keyword\">from</span> <span class=\"token string\">'hooks/useAuth'</span><br><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">default</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">{</span> user<span class=\"token punctuation\">,</span> login<span class=\"token punctuation\">,</span> logout<span class=\"token punctuation\">,</span> resetPassword <span class=\"token punctuation\">}</span> <span class=\"token operator\">=</span> <span class=\"token function\">useAuth</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span><span class=\"token operator\">></span><br>    <span class=\"token punctuation\">{</span>user<span class=\"token punctuation\">}</span><br>  <span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span><span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>This hook itself looks like the following:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">import</span> React<span class=\"token punctuation\">,</span> <span class=\"token punctuation\">{</span> useCallback<span class=\"token punctuation\">,</span> useState<span class=\"token punctuation\">,</span> useEffect<span class=\"token punctuation\">,</span> useContext<span class=\"token punctuation\">,</span> createContext <span class=\"token punctuation\">}</span> <span class=\"token keyword\">from</span> <span class=\"token string\">'react'</span><br><br><span class=\"token keyword\">const</span> authContext <span class=\"token operator\">=</span> <span class=\"token function\">createContext</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br><br><span class=\"token comment\">// Hook for child components to get the auth object and re-render when it changes.</span><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">default</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> <span class=\"token function\">useContext</span><span class=\"token punctuation\">(</span>authContext<span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span><br><br><span class=\"token comment\">// Provider component that wraps components and makes useAuth() available</span><br><span class=\"token keyword\">export</span> <span class=\"token keyword\">function</span> <span class=\"token function\">ProvideAuth</span><span class=\"token punctuation\">(</span><span class=\"token parameter\"><span class=\"token punctuation\">{</span> children <span class=\"token punctuation\">}</span></span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> auth <span class=\"token operator\">=</span> <span class=\"token function\">useAuthProvider</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span>authContext<span class=\"token punctuation\">.</span>Provider value<span class=\"token operator\">=</span><span class=\"token punctuation\">{</span>auth<span class=\"token punctuation\">}</span><span class=\"token operator\">></span><span class=\"token punctuation\">{</span>children<span class=\"token punctuation\">}</span><span class=\"token operator\">&lt;</span><span class=\"token operator\">/</span>authContext<span class=\"token punctuation\">.</span>Provider<span class=\"token operator\">></span><br><span class=\"token punctuation\">}</span><br><br><span class=\"token comment\">// Provide Auth hook that creates auth object and handles state</span><br><span class=\"token keyword\">function</span> <span class=\"token function\">useAuthProvider</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">const</span> <span class=\"token punctuation\">[</span>user<span class=\"token punctuation\">,</span> setUser<span class=\"token punctuation\">]</span> <span class=\"token operator\">=</span> <span class=\"token function\">useState</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token comment\">// Get the logged in user when created</span><br>  <span class=\"token function\">useEffect</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">const</span> user <span class=\"token operator\">=</span> <span class=\"token function\">getLoggedInUser</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token function\">setUser</span><span class=\"token punctuation\">(</span>user<span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><span class=\"token punctuation\">,</span> <span class=\"token punctuation\">[</span><span class=\"token punctuation\">]</span><span class=\"token punctuation\">)</span><br><br>  <span class=\"token keyword\">const</span> <span class=\"token function-variable function\">login</span> <span class=\"token operator\">=</span> <span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token parameter\"><span class=\"token operator\">...</span></span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">const</span> user <span class=\"token operator\">=</span> <span class=\"token operator\">...</span><br>    <span class=\"token function\">setUser</span><span class=\"token punctuation\">(</span>user<span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">const</span> <span class=\"token function-variable function\">logout</span> <span class=\"token operator\">=</span> <span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token operator\">...</span><br>    <span class=\"token function\">setUser</span><span class=\"token punctuation\">(</span><span class=\"token keyword\">null</span><span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">const</span> <span class=\"token function-variable function\">resetPassword</span> <span class=\"token operator\">=</span> <span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span><br>    <span class=\"token operator\">...</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token punctuation\">{</span><br>    resetPassword<br>    login<span class=\"token punctuation\">,</span><br>    logout<span class=\"token punctuation\">,</span><br>    user<br>  <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>This has the additional benefit of keeping all of the authentication logic together. To change to a different auth provider, we would only have to change this one file.</p>\n<h2>Conclusion</h2>\n<p>React provides some really powerful abstractions for creating code that is neatly organised and easy to read. Here, we’ve looked at the three React Hooks I’ve found the most useful: <code>useAsync</code> for executing asynchronous actions either when a component is created or when a user performs an action, <code>useStorage</code> for using <code>localStorage</code> and <code>sessionStorage</code> in the same way as <code>useState</code>, and finally, <code>useAuth</code> for managing users and authentication.</p>\n<p>These three hooks provide powerful abstractions that let you build React components in a simple manner.</p>\n<hr>\n<p>Do you have any other custom React Hooks you find useful? Think I’ve missed any key ones? Please let me know.</p>\n<hr>\n<p>Looking for other ways to keep your code organised? Check out my <a href=\"https://dgls.dev/posts/immutability/\">article on writing IMMUTABLE code</a>.</p>\n<hr>\n<p>Enjoyed this post? Want to share your thoughts on the matter? Found this article helpful? Disagree with me? Let me know by <a href=\"https://twitter.com/dglsparsons\">messaging me on Twitter</a>.</p>\n",
      "date_published": "2020-11-25T09:00:00+00:00"
    },{
      "id": "https://dgls.dev/posts/immutability/",
      "url": "https://dgls.dev/posts/immutability/",
      "title": "How to write IMMUTABLE code and never get stuck debugging again",
      "content_html": "<p>I've written production code in a variety of different languages throughout my career, including Haskell, Scala, Go, Python, Java or JavaScript. While each language has its own clear benefits, working as a polyglot across a range of different paradigms has changed the way I write code. Certain skills and concepts are transferable regardless of the language being written. I believe immutability is one of these key concepts. By writing immutable code it is possible to make programs easier to reason about, easier to write and easier to debug.</p>\n<p>Here, we’ll look at three things:</p>\n<ul>\n<li>how walruses eating cheese can explain how immutability works,</li>\n<li>why you should care, and</li>\n<li>why the counterarguments against immutable code aren’t worth considering.</li>\n</ul>\n<h2>What is immutability?</h2>\n<blockquote>\n<p>“unchanging over time or unable to be changed.” - Oxford Languages definition.</p>\n</blockquote>\n<p>Immutability is the idea that once an object or variable has been created, its value should never change or be updated by anything. For objects or classes, this also includes any fields; literally, nothing should change! The object is effectively read-only.</p>\n<p>Writing code in this style requires a mindset shift at times though. The first time I came across the idea, it made absolutely no sense to me and seemed insane. I was confused and wanted to immediately unpick it all, writing it in a way I was familiar with. Gary Bernhardt, in his <a href=\"https://www.destroyallsoftware.com/talks/boundaries\">talk on boundaries</a>, gives a fantastic example of why it feels so wrong.</p>\n<p>He talks about feeding walruses cheese.</p>\n<p><img src=\"/img/remote/walrus.jpg\" alt=\"Walrus\"></p>\n<p>In a mutable version, we might instruct each walrus to eat some cheese. This cheese then gets added to the contents of their stomach. Makes a lot of sense, right?</p>\n<p>In an immutable version, we have to perform a mind-bending operation. To feed the walruses we would have to:</p>\n<ul>\n<li>create a brand new stomach that’s the same as the old stomach, but with some cheese in it.</li>\n<li>Then, create a new walrus that’s the same as the old walrus, except, with the stomach replaced.</li>\n<li>Then, throw away all the old walrus.</li>\n</ul>\n<p>At first glance, this sounds bonkers but stay with me - let’s look at what makes writing code like this worthwhile.</p>\n<h2>How does it prevent pain when debugging?</h2>\n<p>Have you ever encountered:</p>\n<ul>\n<li><code>undefined is not a function</code> in JavaScript?</li>\n<li><code>NullPointerException</code>s in Java?</li>\n<li><code>SegFault</code> in C/C++?</li>\n<li><code>panic</code> in Go?</li>\n<li><code>NoneType has no attribute foo</code> in Python?</li>\n</ul>\n<p>If you’ve worked in any of these languages, then chances are you probably have. The thing is, all of these errors are caused by the same thing: <strong>missing, or null, data.</strong></p>\n<p>Missing data and null values are definitely among the most difficult types of bugs to track down and fix. I’ve spent countless hours in the past sifting through JavaScript code trying to figure out why the value I thought should be there, wasn’t. Why my application suddenly crashed when everything seemed to be going fine. Sir Tony Hoare even describes null as <a href=\"https://qconlondon.com/london-2009/qconlondon.com/london-2009/speaker/Tony+Hoare.html\">“The Billion Dollar Mistake”</a> because of the countless bugs, security vulnerabilities and crashes that have resulted from it.</p>\n<p><strong>Let’s just agree: nulls can be evil.</strong></p>\n<p>The reason these bugs are so hard to hunt down and to fix is that the effect (the exception) is far away from the cause (the introduction of null). Actually throwing a null pointer error happens some arbitrary amount of time after we introduce a null, and we get <code>undefined</code> errors accessing a property miles away from where we thought the property was set. Debugging becomes a case of reading carefully back through code until we find the cause.</p>\n<p>The more state changes that happen in code, the more places these bugs can be introduced. Instead, we can attempt to reduce the surface area of any code. The fewer mutations in a codebase, the less surface area there is for bugs. This leads to fewer bugs.</p>\n<p>If you only ever set a value once, there’s only one place that value can be faulty. If you make changes to an object as it gets passed around, any one of those places could introduce potential issues. If one of our walruses is faulty, we know it can only have happened when we made the latest walrus, complete with the new stomach. It can’t be an issue with an earlier walrus - they are long gone.</p>\n<p>So really, immutability, or, never changing a value, really saves us from getting stuck debugging.</p>\n<h2>Why performance isn’t a concern</h2>\n<p>Some eagle-eyed people might be thinking “those walruses earlier… isn’t throwing them all in the bin and making new ones pretty expensive? Won’t it make my code slow?”.</p>\n<p>The answer isn’t simple.</p>\n<p>You’re right in saying that throwing away walruses all the time isn’t totally necessary, and it can make things the tiniest amount slower sometimes. The keyword being sometimes here though. Sometimes compilers are clever enough to optimise this behaviour with something more efficient. Some languages even <a href=\"https://doc.rust-lang.org/book/ch03-01-variables-and-mutability.html\">prefer immutability by default</a>. Immutability also has great benefits when it comes to multi-threading or parallelisation, as it allows lock-free sharing, knowing that values <a href=\"https://softwareengineering.stackexchange.com/questions/171253/does-immutability-entirely-eliminate-the-need-for-locks-in-multi-processor-progr\">won’t be changed</a>.</p>\n<p>Despite all this, even if creating new walruses is slower in the language you use, the cost of allocating a new object is almost certainly minuscule compared to anything else within an application. Unless you are benchmarking and actively measuring performance, then you almost certainly shouldn’t care.</p>\n<h2>Conclusion</h2>\n<p>Immutability is a powerful tool when programming. It allows us to write code that is easier to debug and reason about. It requires a bit of a mindset shift, but in my experience, it’s definitely worth making the mental leap.</p>\n<p>Give it a go, and let me know what you think :).</p>\n<hr>\n<p>Looking for other ways to improve the clarity of your code? Why not check out my <a href=\"https://dgls.dev/posts/else-statement/\">post on never using else statements</a>.</p>\n<hr>\n<p>Enjoyed this post? Want to share your thoughts on the matter? Found this article helpful? Disagree with me? Let me know by <a href=\"twitter.com/dglsparsons\">messaging me on Twitter</a>.</p>\n",
      "date_published": "2020-11-17T15:20:00+00:00"
    },{
      "id": "https://dgls.dev/posts/else-statement/",
      "url": "https://dgls.dev/posts/else-statement/",
      "title": "Write better code and be a better programmer by NEVER USING ELSE statements",
      "content_html": "<p>I've been a professional programmer for the last several years. During this time I've risen rapidly through the ranks. I started as an intern, but I'm now the Lead Engineer responsible for a suite of products that serve over 160,000 people in over 140 different countries.</p>\n<p>Recently, I took a look back across all the code I've written during these years (that I still have access to). I've written production code in a huge variety of languages, through Haskell, Scala, Go, Python, Java or Javascript. Across all these, I noticed one significant trend: I pretty much never use the ELSE statement.</p>\n<p>I realised there's a clear rationale behind my aversion to else statements though. I believe that they shouldn't be used, and should be treated as a code smell instead. There are two reasons I think this: else statements break the line-of-sight rule, and they always lack context. I'll explain these two points in detail before showing how you can avoid using else statements.</p>\n<h2>Line of Sight rule</h2>\n<p>I'm a firm believer that code should be optimised to be read by people in the future, rather than being optimised for being executed by machines. In this, I echo Donald Knuth's sentiment:</p>\n<blockquote>\n<p>“Programs are meant to be read by humans and only incidentally for computers to execute.” - Donald Knuth, The Art of Computer Programming.</p>\n</blockquote>\n<p>The problem is the ability to read code is subjective: it's hard to define exactly what makes code readable. One rule that seeks to clarify this though, is the line-of-sight rule. This is a popular rule in the Go community. <a href=\"https://medium.com/@matryer/line-of-sight-in-code-186dd7cdea88\">Mat Ryer</a> defines it concisely in his talk and article. Simply stated, this is the idea that the ‘happy path' in code should be indented as little as possible.</p>\n<p><img src=\"/img/remote/happy-path.png\" alt=\"Happy path\"></p>\n<p>Contrastingly, any error handling or special case code should be indented further.</p>\n<p><img src=\"/img/remote/special-case.png\" alt=\"Special case\"></p>\n<p>Any code that follows this has a unique property: scanning the least indented code is sufficient to understand what any piece of code is doing. Scanning the more indented code shows all the special cases and errors that can occur. This makes it super easy to understand at just a glance.</p>\n<p>So how do else statements relate to this?</p>\n<p>Else statements are problematic as they force code down a level of indentation. It suddenly becomes unclear what code relates to a ‘happy path', and what a special case really is.</p>\n<p><img src=\"/img/remote/unclear-else.png\" alt=\"Unclear\"></p>\n<p>This lack of clarity makes the code harder to scan through, and hurts the readability.</p>\n<h2>Lack of Context</h2>\n<p>The ability to quickly and efficiently scan code is super important. Digesting small sections of code in isolation is a key part of this. We don't want to always have to read every line of code to understand a small part of a codebase.</p>\n<p>Else statements make this harder as they space out the <code>if</code> condition and the code that is affected by it. This is best explained through two examples. First, can you tell what happens when these three lines of code are run?</p>\n<pre class=\"language-go\"><code class=\"language-go\"><span class=\"token keyword\">if</span> myVariable <span class=\"token operator\">==</span> <span class=\"token boolean\">nil</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> “”<br><span class=\"token punctuation\">}</span></code></pre>\n<p>Hopefully, this is fairly obvious. Let's take a contrasting example though:</p>\n<pre class=\"language-go\"><code class=\"language-go\"><span class=\"token punctuation\">}</span> <span class=\"token keyword\">else</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">return</span> “”<br><span class=\"token punctuation\">}</span></code></pre>\n<p>We can see that without the <code>if</code> statement, we can't determine what this is meant to be doing. Why would it return an empty string? Is this an error, or the ‘normal' behaviour? This code instead relies on us remembering, and having read, the earlier context. This doesn't matter much when the statements are small, but if there's complicated logic within the <code>if { … }</code> block or we are scanning quickly, then the separation of context from code can hurt readability massively. It hurts even more when if/else statements are nested, or there are multiple of them in one function (which if statement is this else for?).</p>\n<h2>How to remove else statements?</h2>\n<p>Now we've agreed that else statements are rubbish. But that's not much help by itself. The real trick is how to avoid them. Thankfully, there are two simple ways to do this:</p>\n<ul>\n<li>Inverting the <code>if</code> condition and returning early, and,</li>\n<li>Creating helper functions.</li>\n</ul>\n<h2>Inverting the condition</h2>\n<p>This is the most common instance I come across. It can take two forms too - one where the <code>else</code> is implicit, one where it is explicit. The explicit version looks like the following:</p>\n<pre class=\"language-go\"><code class=\"language-go\"><span class=\"token keyword\">func</span> <span class=\"token function\">doSomething</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token builtin\">error</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">if</span> something<span class=\"token punctuation\">.</span><span class=\"token function\">OK</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    err <span class=\"token operator\">:=</span> something<span class=\"token punctuation\">.</span><span class=\"token function\">Do</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>    <span class=\"token keyword\">if</span> err <span class=\"token operator\">!=</span> <span class=\"token boolean\">nil</span> <span class=\"token punctuation\">{</span><br>      <span class=\"token keyword\">return</span> err<br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span> <span class=\"token keyword\">else</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token boolean\">nil</span><span class=\"token punctuation\">,</span> errors<span class=\"token punctuation\">.</span><span class=\"token function\">New</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"something isn't ok\"</span><span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>The implicit is similar, but without containing an <code>else</code> statement per se. Instead, the <code>else</code> is implied by simply dropping off the end of the function (this one is more common in Python or JavaScript, where <code>None</code> or <code>undefined</code> are returned if nothing is explicitly stated).</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">function</span> <span class=\"token function\">doSomething</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>something<span class=\"token punctuation\">.</span><span class=\"token constant\">OK</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> something<span class=\"token punctuation\">.</span><span class=\"token function\">Do</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>Again, this isn't super clear what the full extent of the behaviour is. Without reading the whole function, the return values aren't clear.</p>\n<p>By simply inverting the <code>if</code> condition, we can solve all these problems though.</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">function</span> <span class=\"token function\">doSomething</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span><span class=\"token operator\">!</span>something<span class=\"token punctuation\">.</span><span class=\"token constant\">OK</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token comment\">// return or throw error</span><br>  <span class=\"token punctuation\">}</span><br>  <span class=\"token keyword\">return</span> something<span class=\"token punctuation\">.</span><span class=\"token function\">Do</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>We can now scan this function and clearly see the indented error condition and normal flow, satisfying the line-of-sight rule. The behaviour is fully explicit, and we have no separation of context. This is much better.</p>\n<h2>Helper Functions</h2>\n<p>We also get else statements that don't directly result in a <code>return</code>. This is usually through some special-case logic that isn't isolated properly. For example</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\">  <span class=\"token keyword\">let</span> charities<br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>country <span class=\"token operator\">!=</span> <span class=\"token string\">\"\"</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>tier <span class=\"token operator\">!=</span> <span class=\"token string\">\"\"</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>      charities <span class=\"token operator\">=</span> <span class=\"token function\">getCharitiesByCampaignCountryAndTier</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">,</span> country<span class=\"token punctuation\">,</span> tier<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span> <span class=\"token keyword\">else</span> <span class=\"token punctuation\">{</span><br>      charities <span class=\"token operator\">=</span> <span class=\"token function\">getCharitiesByCampaignAndCountry</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">,</span> country<span class=\"token punctuation\">)</span><br>    <span class=\"token punctuation\">}</span><br>  <span class=\"token punctuation\">}</span> <span class=\"token keyword\">else</span> <span class=\"token punctuation\">{</span><br>    charities <span class=\"token operator\">=</span> <span class=\"token function\">getCharitiesByCampaign</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token comment\">// do something with charities</span></code></pre>\n<p>The readability of this can be improved by pulling the charity-getting logic into its own function. This then lets the special cases be handled appropriately, and return early. By inverting some of the if statements, this can be improved further.</p>\n<p>For example:</p>\n<pre class=\"language-javascript\"><code class=\"language-javascript\"><span class=\"token keyword\">function</span> <span class=\"token function\">getCharities</span><span class=\"token punctuation\">(</span><span class=\"token parameter\">campaign<span class=\"token punctuation\">,</span> country<span class=\"token punctuation\">,</span> tier</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>country <span class=\"token operator\">==</span> <span class=\"token string\">\"\"</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token function\">getCharitiesByCampaign</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">if</span> <span class=\"token punctuation\">(</span>tier <span class=\"token operator\">==</span> <span class=\"token string\">\"\"</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> <span class=\"token function\">getCharitiesByCampaignAndCountry</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">,</span> country<span class=\"token punctuation\">)</span><br>  <span class=\"token punctuation\">}</span><br><br>  <span class=\"token keyword\">return</span> <span class=\"token function\">getCharitiesByCampaignCountryAndTier</span><span class=\"token punctuation\">(</span>campaign<span class=\"token punctuation\">,</span> country<span class=\"token punctuation\">,</span> tier<span class=\"token punctuation\">)</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>This helper function neatly encapsulates all the logic we'd need, removes the need for any else statements, and does a much better job of keeping the happy-path code to the left. This is much easier to scan through, and much more readable as a result.</p>\n<h2>Conclusion</h2>\n<p>Else statements are a weird code smell. They harm the readability of any code by forcing equal levels of indents for error handling and for happy paths. They also have the unique ability to separate code from the logic that affects it. They are easy to avoid through the two techniques of returning early and splitting logic into helper functions. As a result, they are unnecessary. You can write better code and be a better programmer by never using them.</p>\n<p>Some caveats (to stop the pedants).</p>\n<ul>\n<li>In SQL CASE WHEN … ELSE … isn't really avoidable.</li>\n<li>In Scala, implicit returns (avoiding return statements for referential transparency) means you have to use them - you don't really have the ability to 'return early'.</li>\n<li>Ternary operators are fine.</li>\n<li>In python, the ternary operator uses <code>else</code>. This is also fine.</li>\n</ul>\n",
      "date_published": "2020-11-10T13:20:00+00:00"
    },{
      "id": "https://dgls.dev/posts/communication/",
      "url": "https://dgls.dev/posts/communication/",
      "title": "Why EFFECTIVE COMMUNICATION is the key skill for being an awesome programmer",
      "content_html": "<p>Programming is all about communication. We communicate with computers to tell them what we want them to do. We instruct them to carry out tasks to the finest degree of accuracy. We communicate with our peers, sharing ideas and technology. We communicate with business owners, gathering requirements and context on problems. And yet, communication is a difficult thing to get right.</p>\n<p>Have you ever tried to write a blog, teach someone about a topic, or write an email on a difficult topic?</p>\n<p>If you have, then you will know how challenging precise communication can be.</p>\n<h2>🗣️ Why is communication so hard</h2>\n<p>When programming, all our communication immediately becomes at least twice as difficult. We write programs that have to be understood by the computer so they can run. But, they also have to be understood by future readers: people editing or maintaining them. They also have to capture exact requirements with little or no room for error. These requirements typically come from communication with non-programmers.</p>\n<p>At the very least this means all programs are acting on around four levels of communication:</p>\n<ol>\n<li>🗣️ A non-technical individual communicating to a developer.</li>\n<li>💻 A developer communicating his intent to an application.</li>\n<li>🤖 The application running and communicating to the computer.</li>\n<li>🐛 Another developer looking to extend or debug the application.</li>\n</ol>\n<p>Bugs, misunderstandings and issues in translation can occur at any, or all, of these layers. Writing software becomes a game of Chinese whispers.</p>\n<h2>🙊 Chinese whispers</h2>\n<p><img src=\"/img/remote/whisper.jpg\" alt=\"Whispering\"></p>\n<p>This game becomes even bigger and more error-prone as you scale up teams, or have open-source contributors. The more programmers working on a codebase, the more miscommunication and misunderstanding there can be.</p>\n<p>This communication is even more challenging because of the huge variation in what programs can do. A web application is concerned with attractively arranging pixels on a screen. A finance application might need complex calculations to be exact to the penny/cent. A device driver might care about manipulating bespoke hardware to certain voltages. The range is huge, and this complexity is part of the reason programming can be so overwhelming.</p>\n<h2>🤷 Ambiguity</h2>\n<p>Communication is also inherently hard because of how language works. In everyday speech, there are multiple ways to interpret any sentence. These ways are often dependent on context or our environments. And then, there are multiple ways to represent everything as code. There's an old joke that illustrates this well.</p>\n<p><img src=\"/img/remote/milk.jpg\" alt=\"Milk\"></p>\n<blockquote>\n<p>A software engineer gets sent to the shops by his wife.</p>\n</blockquote>\n<blockquote>\n<p>She tells him &quot;Go and get a pint of milk, and if they have eggs get six&quot;.</p>\n</blockquote>\n<blockquote>\n<p>The engineer disappears and returns an hour later with six pints of milk.</p>\n</blockquote>\n<blockquote>\n<p>“Why on earth did you get six pints of milk!?” His wife asks, furious.</p>\n</blockquote>\n<blockquote>\n<p>He confidently replies &quot;they had eggs!&quot;.</p>\n</blockquote>\n<h2>💥 So what can we do?</h2>\n<p>We've identified that communication can act as Chinese whispers. Language can be ambiguous, and we have many different points of communication in our day-to-day working. As a result, the quality of any communication is of critical importance. An individual who is capable of communicating effectively with non-technical people, other programmers and with a computer is invaluable.</p>\n<p>It's important to remember how we communicate. When thinking of communication my mind always jumps straight to two people talking, or a board room full of people wearing suits.</p>\n<p><img src=\"/img/remote/meeting.jpg\" alt=\"Meeting\"></p>\n<p>However, this is rarely the case. We communicate far more frequently in our work, and talking isn't the only way we communicate. Talking often isn't even the best way to communicate.</p>\n<p>There are four topics we communicate about and four ways we usually communicate these:</p>\n<ol>\n<li>Code - we communicate through reading and writing code</li>\n<li>Architecture - typically represented both in code and in diagrams.</li>\n<li>Requirements - these are usually gathered through conversations or user stories.</li>\n<li>Deadlines - usually through conversations or calendar events.</li>\n</ol>\n<p>For code. Having clear code, that is easy to understand and digest makes life much easier. It frees up our brains to solve problems, rather than focusing on the minutiae of how an application works. Just like Donald Knuth, I believe that &quot;programs are meant to be read by humans and only incidentally for computers to execute&quot;. When writing code, optimising for readability should <em>always</em> be our main focus. A well-structured, well-written codebase is far less prone to misinterpretation. Far easier to digest, and much more enjoyable to work with.</p>\n<p>For architecture, we must clearly define and delineate any systems. Everything should have a clear purpose and a single responsibility. It should also be clear how these systems communicate. This should all be easy to digest (via diagrams, sensible naming, clear purpose and sensible code structure).</p>\n<p>For requirements, we must extract every degree of detail possible. Clarify on everything, even points that seem obvious. Make sure they are all written down and that a common understanding is reached across the team.</p>\n<p>Finally, deadlines. You might think these are unambiguous: &quot;have X done by Y date&quot;. It seems straightforward, but remember that many &quot;Agile&quot; teams have to define what 'done' really means. Does it mean code complete? Tested? Deployed? Handed over to a different team? All the above and defects fixed?</p>\n<h2>✨ In Conclusion</h2>\n<p>Communication is challenging. Everyday language is ambiguous: we can often interpret very different meanings from the same sentence. As teams grow, our points of communication grow with them, and, even in small teams, several layers of communication take place. Mis-interpretation or a poor understanding can sneak in at any of these layers.</p>\n<p>As a result, we have to focus continually on communicating effectively. Having good quality code that is clear in purpose and easy to read and understand is essential. We need to keep our systems organised as neatly as possible, with clear diagrams and purpose. Requirements and deadlines need constant questioning, and every assumption challenged. Through doing all this, we can communicate more effectively, and be awesome programmers as a result.</p>\n",
      "date_published": "2020-11-03T12:20:00+00:00"
    },{
      "id": "https://dgls.dev/posts/avoid-cognitive-overload/",
      "url": "https://dgls.dev/posts/avoid-cognitive-overload/",
      "title": "Avoid COGNITIVE OVERLOAD when programming in 4 simple ways",
      "content_html": "<p>Programming can be an arduous activity. You have to remember what you are doing. Remember the context and inner workings of an application or system. Remember the syntax and building blocks of the language you are working in. Remember locations of code to come back to and tweak later. Remember what steps you have to take to achieve a goal. And you often have to do all this while learning a new codebase, technology, language and domain.</p>\n<p>All these things you have to remember fight for space inside your brain. You can feel lost, overwhelmed, or feel like your brain has turned to mush. Your brain has too much to remember, and too much to process all at once. As a result, it starts to drop the ball. Making decisions becomes a difficult task as you overthink, over-analyze and over-complicate <a href=\"https://www.psychologytoday.com/gb/blog/in-practice/201810/seven-thinking-errors-contribute-mental-overload\">everything</a>. You forget what you should be doing and forget what you should be doing later. This is COGNITIVE OVERLOAD.</p>\n<p>Our brains aren't designed to store and process all this information all the <a href=\"https://www.gamasutra.com/view/feature/190891/programmer_interrupted.php?print=1\">time</a>. Luckily, there are four simple steps you can take to reduce the amount of strain on your brain.</p>\n<h2>1. ✍️ Write Everything Down</h2>\n<p><img src=\"/img/remote/writing.jpg\" alt=\"Writing\"></p>\n<p>The first thing I want to talk about is 'Getting Things Done'. This is a productivity methodology introduced by <a href=\"https://gettingthingsdone.com/\">David Allen</a>. His book tackles a common problem: often we have many different things in our lives to track and organise. These commitments can range from work, friends, hobbies or family. Our commitments are usually only stored within our head and as a result, are badly managed.</p>\n<p>The most important idea is to realise that our brains are not a good place for storing information. Instead, we should be using our brains as a source of ideas. A place for creative thinking.</p>\n<p>The best way to do this is by removing anything our brains need to remember.</p>\n<p>The solution is super simple: write everything down. We can write down how an application works. We can write down the basic syntax rules for a programming language. We can write down a to-do list of all the things we need to remember.</p>\n<p>Every single piece of information written down is one less thing to think about. One less thing our brains have to keep. This reduces the cognitive load by simply removing information we can keep elsewhere.</p>\n<h2>2. 🔖 Bookmark Locations To Come Back To</h2>\n<p><img src=\"/img/remote/bookmarks.jpg\" alt=\"Bookmarks\"></p>\n<p>Have you ever gone to make a specific change when programming and recognised a piece of tech debt or a bug lurking? And then, by the time you've jumped down a rabbit hole of fixing things up you've forgotten why you were even there in the first place?</p>\n<p>Every single distraction we get when programming is one more thing to remember later. Yet, fixing bugs, improving code quality and cleaning up tech debt are all important.</p>\n<p>Again, the solution here is simple: every time we want to diverge from the task we started on, we need to make a note. Attempting to remember does not work as this just adds to the cognitive load. Even more so because you can get distracted from a distraction. You can fix tech debt and get distracted by a bug. Or when you fix one problem, realise that there's another you didn't initially spot.</p>\n<p>I like to think of this as a stack of plates we are balancing, all of different sizes and shapes. Trying to keep one balanced isn't a problem. Getting diverted adds another plate to the top of the pile though. As we get diverted more and more the stack of plates becomes heavy,  difficult to balance, and increasingly precarious. If instead, we were to put each plate down as we picked up a new one (by writing it down), we can just keep a single plate balanced. The cognitive load here drops. We can instead use our brain to focus on the task at hand, rather than on balancing plates.</p>\n<h2>3. 🕑 Spend Time Away</h2>\n<p><img src=\"/img/remote/relax.jpg\" alt=\"Time Away\"></p>\n<p>It's a widely held theory that sleep serves a clear purpose: it helps our brains decongest. Sleep helps store important memories and  things you've learned. It gets rid of unimportant memories. It allows our brains to sort through complicated thoughts and <a href=\"https://www.healthline.com/health/why-do-we-dream\">feelings</a>.</p>\n<p>Our brains are complicated devices. It's rarely clear how they work or what they are doing, and they are not well understood.</p>\n<p>But, this idea that sleep helps decongest our brains gives a powerful insight. Our brains are capable of doing <em>background processing</em>. We don't have to actively think on a problem for our brains to digest it. Did you ever wonder why people have some of their best ideas in the shower, or when they are out for a run? This explains why.</p>\n<p>Furthermore, it's important we tap into this background processing the brain can offer. Why bother banging your head against a wall over and over, when taking a break can allow our brain to figure things out?</p>\n<h2>4. 🗣️ Talk To People</h2>\n<p>Have you ever heard of <a href=\"https://en.wikipedia.org/wiki/Rubber_duck_debugging\">rubber duck debugging</a>? The idea comes from a book written by <a href=\"https://pragprog.com/titles/tpp20/the-pragmatic-programmer-20th-anniversary-edition/\">Hunt and Thomas</a>. The idea is that a programmer would explain his or her code, often line-by-line to a rubber duck. In forcing his/herself into the perspective of a teacher and explaining what the code should do, and actually does, problems are often spotted.</p>\n<p><img src=\"/img/remote/duck.jpg\" alt=\"Rubber Duck\"></p>\n<p>The idea used a rubber duck as this is an 'inanimate object', and prevents disrupting anyone else. However, this neglects all the benefits that talking to another person can provide. They can:</p>\n<ul>\n<li>ask questions that make you consider your approach</li>\n<li>provide suggestions on how you can tackle a problem</li>\n<li>suggest alternative solutions</li>\n<li>provide a wider range of perspectives on the matter</li>\n<li>often, provide more expertise on a subject area</li>\n<li>provide a more intricate knowledge of existing solutions</li>\n</ul>\n<p>And, even more than this, the ability to share knowledge with a teammate is a valuable skill. By having two people understand a problem the brainpower used to solve a problem doubles. This can lead to better solutions (it's no wonder <a href=\"https://en.wikipedia.org/wiki/Pair_programming\">pair programming</a> exists).  Sharing, really is caring.</p>\n<h2>✅ To Conclude</h2>\n<p>Programming is a complicated task. Programmers often have to hold many things in their memory. And yet, they are expected to simultaneously come up with creative solutions to complicated problems. This leads to a huge amount of cognitive load.</p>\n<p>The solution is simple though. We need to remove as much of this load as possible, allowing the brain to focus on the tasks at hand. We can achieve this in 4 simple ways:</p>\n<ul>\n<li>By writing down everything we learn.</li>\n<li>By bookmarking anything that we need to come back to.</li>\n<li>By allowing our brains to unclog by spending time away.</li>\n<li>By changing perspective and sharing with others.</li>\n</ul>\n<hr>\n<p><em>Do you think there is anything I have missed? Do you use any of these methods? Please comment, or let me know.</em></p>\n",
      "date_published": "2020-10-26T09:51:00+00:00"
    },{
      "id": "https://dgls.dev/posts/why-learning-programming-is-SO-HARD/",
      "url": "https://dgls.dev/posts/why-learning-programming-is-SO-HARD/",
      "title": "Learning programming is DIFFICULT",
      "content_html": "<p>Have you ever wanted to learn how to program, or to learn a new concept? Have you ever come across a technology you wanted to play around with but had no idea how to get started? Does it feel like there is <em>too</em> much information about programming on the internet?</p>\n<p>Programming is a difficult topic to break into. It's a complicated field. There's a lot of information to learn. There are a lot of contrasting opinions on the internet. The field moves amazingly fast, with new trends and technologies popping up all the time. To top it all off, guides and tutorials don't build up your knowledge to an adequate level. They leave you <a href=\"https://dev.to/dglsparsons/the-drug-of-online-tutorials-2od4\">stumbling in the dark</a>.</p>\n<p>But why is this? What makes all these tutorials fall short? Why can't you follow a guide and learn everything you need to get started?</p>\n<p>Most tutorials, guides or courses fall short for at least one of three reasons:</p>\n<ul>\n<li>They promote misinformation, guiding you down an opinionated or flawed path.</li>\n<li>They fail to account for, and teach, the huge amount of knowledge you need beforehand.</li>\n<li>They focus on low-level details, rather than overarching concepts and their rationale.</li>\n</ul>\n<p>Here, I will examine each of these three flaws, in turn, arguing how they all undermine successful learning. I'll then argue for a simplified approach to learning. Instead, we should be focussing on concepts and experiences over implementation.</p>\n<h2>A sea of (mis)information</h2>\n<p>The internet is an invaluable tool for any type of learning. The amount of information readily available is second to none.</p>\n<p>However, not all information is created equally. On the internet, love it or loathe it, anyone can create content. This leads to a divide. How do you know what content is worth looking at? How do you know who's opinions are trustworthy?</p>\n<p>Studies have shown that bloggers are trusted. Trusted a scary amount. They are more trusted than <a href=\"https://moreniche.com/blog/bloggers-are-third-most-trusted-by-consumers/\">celebrities, social media contacts and journalists</a>.</p>\n<blockquote>\n<p>If you’re a blogger, you’re the third most trusted source of information... behind only friends and family.</p>\n</blockquote>\n<p>Should we trust these people?</p>\n<p>The problem is the low barrier to entry. It's both a strength and weakness of online material. Anyone can create a blog or video claiming they know everything there is to know about programming. As long as someone is presenting with confidence it is impossible to tell an expert from a beginner.</p>\n<p>We live in a society fuelled by views, likes, comments and social media interaction. In this world, it is not the most insightful information that gets the most attention. It is the content with the most-clickbaity title. The author who writes a compelling story, or the person who promises you a quick-win tutorial.</p>\n<p>As a result, the most promoted information can often be the least valuable. People are more likely to create content that will get viewed, rather than content that will teach you everything you need to know.</p>\n<h2>The HUGE amount of knowledge</h2>\n<p>Have you ever heard the interview question: &quot;What happens when you type <a href=\"http://google.com\">google.com</a> into your browser's address bar and press enter?&quot;</p>\n<p><img src=\"/img/remote/search.jpg\" alt=\"Browser search\"></p>\n<p>If you haven't, take a moment to think. It's a big question. How deep can your knowledge of it go?</p>\n<p>It seems a trivial task. Typing an address or search term into a browser is something we all do hundreds of times every day. But the explanation is anything but trivial. People have tried to create <a href=\"https://github.com/alex/what-happens-when\">comprehensive guides</a> answering this question. Even then, they don't cover everything. It depends on what operating system you're using. It depends on what browser you're using. It depends on what keyboard you are using. It depends on what motherboard your computer has. It depends on what monitor you are using. It depends on how your internet is set up. It depends on where in the world you are... it depends on... well, everything.</p>\n<p>There is a crazy amount of detail involved in answering this straightforward question. This highlights how complicated programming can be. An overwhelming amount is going on. If you're just starting out learning, this puzzle can be too much to handle. Without a knowledgeable guide to show you what to learn, it's tricky to know where to start. It's a puzzle you need to break apart, but have no idea how.</p>\n<h2>The lack of concept-driven learning</h2>\n<p>Despite the huge amount of complexity in the previous example, it's important to remember one thing.</p>\n<p><strong>Nobody knows everything.</strong></p>\n<p>Most programmers are capable of using the internet as a black-box without dealing with all its complexities. We do not worry about the <a href=\"https://en.wikipedia.org/wiki/Internet_protocol_suite\">TCP/IP model</a>. We do not worry about lost packets, signal-to-noise ratio along wires, or routing connections to servers. We don't worry about keyboard hardware, operating systems, or motherboards. This is because these are concepts. Concepts that we can abstract away.</p>\n<p>The problem, though, is that beginners often bump up against all these concepts. It's overwhelming how many there are, and how they are often assumed knowledge. For example, before building and hosting a website there is a level of understanding you need to have.</p>\n<ul>\n<li>What is a website?</li>\n<li>What is a webpage?</li>\n<li>Why do we have HTML / css / javascript?</li>\n<li>What is the DOM?</li>\n<li>What is a browser API?</li>\n<li>What is a webserver?</li>\n<li>How does a browser communicate with a webserver?</li>\n<li>How does DNS work?</li>\n<li>What is a function, module, page, view?</li>\n<li>What is a package manager?</li>\n<li>What is a package?</li>\n<li>What is a dependency?</li>\n<li>What is accessibility?</li>\n<li>What is a build?</li>\n<li>What is deployment?</li>\n<li>What is a version?</li>\n<li>What is a cache?</li>\n<li>How does a browser store data?</li>\n<li>What is a framework?\n...</li>\n</ul>\n<p>The list goes on. Most tutorials fail to recognise this massive amount of knowledge you need beforehand. Instead, they jump in at the deep end. &quot;Install this npm package&quot;, &quot;run this command&quot;. Or worse, &quot;copy this code&quot;, &quot;follow me&quot;.</p>\n<p><img src=\"/img/remote/confused.png\" alt=\"Confused\"></p>\n<p>Instead, there is a need to focus on what concepts and abstractions we use and rely on as programmers. Rather than teaching how to build a website, we need to give insight into our terminology and culture. We need to focus on <em>why</em> we do things. What each abstraction is for, what is its purpose. As a beginner, programming is overwhelming because nobody explains the concepts you need. There is no source for this information. Instead, everyone assumes you can pick up concepts as you go along. Or, they assume you understand enough beforehand.</p>\n<p>This is one of the key reasons a 'tutorial hell' exists. It's very simple to watch someone build something. But, without understanding the concepts they use as building blocks, it is impossible to replicate.</p>\n<p>Even experienced programmers get tripped up by this.</p>\n<p>I was recently chatting with a friend who moved jobs. After his first few days, he told me his head felt like mush. He had so much to learn. After a bit of discussion, I realised the problem was that he was learning three things at once:</p>\n<ul>\n<li>He had to learn a whole new technology stack.</li>\n<li>He had to learn the ways of working within the company.</li>\n<li>He had to learn the domain of the companies product.</li>\n</ul>\n<p>Even for someone with a wealth of experience, learning those three things all at once is daunting. But he is bringing to the table years and years of experience. Contrast this to a complete beginner, and no wonder it's so difficult!</p>\n<h2>How do you avoid these problems?</h2>\n<p>I wish I had an easy solution to all these problems. I wish there was an easy way to get trustworthy information. To inform people of the core concepts that power programmers everywhere. To tackle the huge amount of knowledge by teaching you what you need to know without getting weighed down by complexity. The solution is not an easy one. There are, however, two solutions that spring to my mind.</p>\n<p>Number 1: Get a mentor. An experienced programmer is a powerful ally to have. They can point you in the right direction with your learning. They can answer your questions. They can teach you concepts that you don't understand. With the current climate of the world, more and more people are available on the internet. It's easy to ask for support and there are huge numbers of people eager to help out.</p>\n<p>Number 2: A useful tutorial course. Over time, I've stumbled across a few resources that cement the logic you need to succeed. However, I've always found these few and far between. I'm sure there are lots out there because there are so many courses, blogs and guides are available. I don't know where the trustworthy, concept-first courses are though. Are people interested in a concept-first style tutorial? Have you come across any good resources for this? If so, please share these useful resources!</p>\n<hr>\n<p><em>Do people share my same criticisms of tutorials and guides? Do you share the feeling that it's overwhelming at times? Please let me know - and let me know if I can help in any way. If you're more experienced, please share any resources you have that helped you.</em></p>\n",
      "date_published": "2020-10-20T13:18:00+00:00"
    },{
      "id": "https://dgls.dev/posts/the-drug-of-online-tutorials/",
      "url": "https://dgls.dev/posts/the-drug-of-online-tutorials/",
      "title": "The DRUG of online tutorials",
      "content_html": "<p>Have you ever felt like you're stumbling in the dark trying to learn a new concept? Like you know where you're trying\nto get to, but absolutely no idea how to get there?</p>\n<p>This is an incredibly common feeling when learning about technology. The field is MASSIVE. It's ludicrously complicated.\nAnd to make matters even more difficult, it seems to be changing every few months.</p>\n<p>This makes programming tricky to get started in. You have no idea what you should be looking for, what to Google, or\nhow to find information about what you want to learn. At the same time, any information you do find doesn't seem to be\ntrustworthy or dependable. You find a JavaScript article from 4 years ago, but when you apply what it says, people say you're doing it\nwrong, or &quot;nobody does it like that anymore&quot;. Looking on Stack Overflow, all the answers point to jQuery. But nobody has\nused that since 2015. You feel lost.</p>\n<p>The natural reaction is to reach for tutorials. These will hold your hand, and guide you to the promised land of programming\nliteracy. Just study this course on Udemy. Just watch this video on YouTube. Just learn these few things. Then, you'll be set\nfor a lucrative career in software.</p>\n<p><strong>They hook you in like a drug.</strong></p>\n<p>You spend hours finding the right videos to watch. The right course to buy. The right guides to follow online. You think\nyou're understanding as you watch someone build an application using the skills you'd always hoped for.</p>\n<p>And when you're done? You sit down. You think you know more than when you started (because, well, you do). But you still have no idea\nhow to get started. You're still stumbling in the dark. You still have no idea how to get to where you want to go.</p>\n<p>The solution? More courses. More learning. It's all a lie. It's not the way to learn. It's a way to waste your time\nspinning, getting nowhere.</p>\n<p>All courses fall into the same trap. They sell you a dream, and hook you in like a drug. But they DON'T teach you\nthe skills you need to succeed on your own. They keep you hooked because of this.</p>\n<p>What's the solution? Come up with ideas of projects to build. It's tricky I know! Stumble in the\ndark. Find a mentor who can shine light where you need it. Contribute to open source projects. Take part in Hacktober.\nDo Advent of Code when it's Christmas.</p>\n<p>But most importantly, enjoy your time there. Enjoy being blind. Enjoy every day being an adventure. Every day being a\nchallenge. Learning new things until your brain hurts. Because this is what learning is about. And being a good programmer is about learning.</p>\n",
      "date_published": "2020-10-12T15:45:00+00:00"
    },{
      "id": "https://dgls.dev/posts/why-we-wrote-our-own-logger/",
      "url": "https://dgls.dev/posts/why-we-wrote-our-own-logger/",
      "title": "Go Logger - Why we wrote our own",
      "content_html": "<p>At Shaamazi, we created and open-sourced our logger: <a href=\"https://github.com/shamaazi/antilog\">antilog</a>. We created this\nout of frustration at the other loggers available for Go. In our minds, they all fell short in at least one of several ways.\nWe wanted a logger that was simple and easy to use.\nA logger that doesn't bring a mountain of dependencies.\nA logger that outputs structured logs.\nA logger where context can be built over time.\nAnd finally, a logger that doesn't have log-levels.</p>\n<p>Here I'll look at the following:</p>\n<ul>\n<li>Why we care about logging so much.</li>\n<li>What the current logging landscape for Go looks like.</li>\n<li>Why each of these fundamental features (structured logging, building context and no log-levels) are so important</li>\n<li>How popular alternatives fail to meet our needs.</li>\n</ul>\n<h2>Why we care about logging so much</h2>\n<p>Our largest product is a charity system that automates donations during Ramadan. Over 160,000 people, in around 140\ndifferent countries, use this product. Despite this, our engineering team is tiny with two engineers working on this\nproduct. As a result, the ability to quickly and efficiently identify problems in our code through inspecting logs is crucial.</p>\n<h2>What other logs are there?</h2>\n<p>Go's standard library provides a <a href=\"https://golang.org/pkg/log/\">logger module</a>. Yet, this module is very minimal:\nit gives a series of functions that can be called to log text, but little else. There are some 'batteries included'\nlogging frameworks, such as <a href=\"https://github.com/sirupsen/logrus\">logrus</a>. Unfortunately, we wanted a middle ground\nbetween the two. Logrus provided too much customisability. It is very verbose to use, and has a significant footprint.\nHowever, the standard library wasn't able to provide all the features we wanted. A third alternative is the\n<a href=\"https://github.com/uber-go/zap\">zap</a> logger created by Uber. This looks like a strong contender but adds a lot of complexity.\nIt has far more configuration with its various logger types (Sugar, Production, Development, etc.).\nThere is also a <code>Sync()</code> function, a mix of <code>sprintf</code> and structured logging, and log-levels.</p>\n<p>Other alternatives do exist, but we could not find one that met our criteria.</p>\n<h2>Structured Logging</h2>\n<p>Structured logging is the idea that logs should be more than a string message. They should also be able to embed and\ndisplay structured information. There are two approaches to this: using a human-readable\n<a href=\"https://brandur.org/logfmt\">logfmt</a> format, or, writing\nlogs out as JSON. Logfmt has it's advantages; it is arguably more human-readable at an initial glance. However, most\ntools for searching through logs, such as Splunk, Kibana or CloudWatch, provide support for JSON logs. JSON is easier\nfor programs to read and query and also allows complex datatypes to be expressed in logs. In our case, we are writing\nlogs into CloudWatch. CloudWatch provides explicit support for querying JSON logs. As a result, we are <strong>only</strong> interested\nin writing JSON.</p>\n<p><img src=\"/img/cloudwatch-logs.jpg\" alt=\"What our (test) logs look like in cloudwatch\"></p>\n<p>The ideal would be for any logger to output JSON by default. Some loggers, such as zap, meet this need. Of the main two most\npopular contenders, the standard library and logrus, both fall short. The standard library doesn't provide structured logging\nat all. Logrus does but requires some small amount of config to achieve this (<code>logrus.SetFormatter(&amp;logrus.JSONFormatter{})</code>).\nThis configuration is only a single line of code, but it is easy to miss when writing a new application, script or tool.</p>\n<p>Supporting many output formats is another pitfall. This adds more complexity to the logger, making it bulkier than we would like\n(in both binary size and CPU time). Instead, a logger that outputs JSON by default with no configuration required is ideal.\nantilog can be used straight out of the box, it requires no configuration at all.</p>\n<h2>Building Context</h2>\n<p>As part of our logging, we want the ability to build up of information in logs over the lifecycle of an operation.\nTo get a full picture of what is happening in our logs, we need to be able to provide context to any messages.\nTo illustrate this point, here is a pretty rubbish log message that could show an issue parsing data:</p>\n<pre class=\"language-json\"><code class=\"language-json\"><span class=\"token punctuation\">{</span> <span class=\"token property\">\"timestamp\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"2019-11-18T14:00:32Z\"</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"message\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"unable to parse json\"</span> <span class=\"token punctuation\">}</span></code></pre>\n<p>We can't easily identify what is going on here: is this an application issue? is it expected? What's causing it?\nBy adding a small amount of context we can immediately glean much more information from our logs:</p>\n<pre class=\"language-json\"><code class=\"language-json\"><span class=\"token punctuation\">{</span> <span class=\"token property\">\"timestamp\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"2019-11-18T14:00:32Z\"</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"message\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"unable to parse json\"</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"path\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"/api/signup\"</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"method\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"POST\"</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"status\"</span><span class=\"token operator\">:</span> <span class=\"token number\">400</span><span class=\"token punctuation\">,</span> <span class=\"token property\">\"request_id\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"1234abc\"</span><span class=\"token punctuation\">}</span></code></pre>\n<p>We can now see that it's an API endpoint for signup this happened at. From the 400 response, we can assume that this is\ndue to a user submitting bad data rather than an error in our system. From a small amount of context, a previously\nmeaningless log message  becomes valuable.</p>\n<p>Unless we have a messy codebase, the places where want to write logs don't necessarily have access to all\nthe information we might want. We don't want polluting to our code by passing <code>path</code>, <code>method</code>, <code>request_id</code> and many other\nfields around. We want the ability to attach these to our logger, building up the eventual output one piece at a time.</p>\n<p>In antilog we can build up an output by passing the logger around (or attaching it to context, if you've done much Go):</p>\n<pre class=\"language-go\"><code class=\"language-go\">    logger <span class=\"token operator\">:=</span> antilog<span class=\"token punctuation\">.</span><span class=\"token function\">With</span><span class=\"token punctuation\">(</span><br>       <span class=\"token string\">\"common\"</span><span class=\"token punctuation\">,</span> <span class=\"token string\">\"this is a common field\"</span><span class=\"token punctuation\">,</span><br>       <span class=\"token string\">\"other\"</span><span class=\"token punctuation\">,</span> <span class=\"token string\">\"I also should be logged always\"</span><span class=\"token punctuation\">)</span><br><br>    logger<span class=\"token punctuation\">.</span><span class=\"token function\">Write</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"I'll be logged with common and other field\"</span><span class=\"token punctuation\">)</span><br>    logger<span class=\"token punctuation\">.</span><span class=\"token function\">Write</span><span class=\"token punctuation\">(</span><span class=\"token string\">\"Me too\"</span><span class=\"token punctuation\">)</span></code></pre>\n<h2>No Log levels</h2>\n<p>A lack of log-levels seems like an oversight for a logging library. However, I strongly believe they aren't necessary\nand just complicate matters. Dave Cheney argues the same on <a href=\"https://dave.cheney.net/2015/11/05/lets-talk-about-logging\">his blog</a>.\nThis can be broken down by reasoning about each different log level:</p>\n<p><strong>Warning:</strong></p>\n<p>Warning messages fall into one of two categories:</p>\n<ul>\n<li>warnings you can ignore</li>\n<li>warnings you can't ignore</li>\n</ul>\n<p>Warnings that you can ignore are interesting. By definition, nothing has gone wrong. As such, they are no different to info level logs.\nWarnings that you can't ignore show the opposite: they are errors that are not logged at the correct level. As it is impossible to\nhave a warning that does not fit into these two categories, warning as a log level is useless.</p>\n<p><strong>Error:</strong></p>\n<p>A similar approach removes the need for errors. Errors fall into one of two categories:</p>\n<ul>\n<li>Errors that you are handling (and recovering from)</li>\n<li>Errors that you are not handling.</li>\n</ul>\n<p>If you are handling the error, then the application will continue as expected, and the log line is only informational. If you are not\nhandling the error, then you should not be logging it. It is the responsibility of the calling code to manage this error. As it is\nimpossible to have an error that does not fit into these categories, the error log level is also useless.</p>\n<p><strong>Info:</strong></p>\n<p>Now there are no more warnings and errors, we have a single log-level: info. By itself, this is no different to not having any log\nlevels at all. Instead, we have 'things we should log' and 'things we shouldn't log'.</p>\n<p>This argument to remove log levels can extend further. Log-levels are an attempt to provide a measure of how useful a particular\nmessage is. This is a flawed approach as the usefulness can't be determined when the message is written. This is because we do not\nknow why our future selves may be looking at logs. It could be to diagnose a particular race condition, to fix a bug, or to\ntrack user behaviour. Without knowing why we will be looking at logs, it is impossible to determine what information is going to be\nthe most relevant. Any attempt to predict is just noise. As a result, log-levels are a fruitless task.</p>\n<p>In the context of antilog, we wanted to avoid the typical <code>log.Info</code>, <code>log.Warn</code> and <code>log.Error</code> interfaces most\nloggers use. This leads to forced decision-making that is not productive. I've been on the end of one-too-many arguments\nover whether a log should be <code>Info</code> or <code>Warn</code> (see also <a href=\"https://en.wiktionary.org/wiki/bikeshedding\">bikeshedding</a>). Most\nlogging libraries do not give this freedom of thinking, and instead, force you to decide. We, contrastingly, provide\njust a <code>Write</code> method. Either <code>Write</code> your logs or don't.</p>\n<h2>In Conclusion</h2>\n<p>The current logging landscape for Go was lacking. Existing libraries overcomplicated the process of writing logs by\nfalling into one of four traps:</p>\n<ul>\n<li>forcing the use of log-levels;</li>\n<li>lacking structured logging;</li>\n<li>not allowing context to be built</li>\n<li>and allowing too much configuration.</li>\n</ul>\n<p>We sought a solution to these problems by creating our logging library, <a href=\"https://github.com/shamaazi/antilog\">antilog</a>.\nWe've been using it for around a year now and love it.</p>\n",
      "date_published": "2020-10-09T13:50:00+00:00"
    },{
      "id": "https://dgls.dev/posts/a-simple-reference-data-trick/",
      "url": "https://dgls.dev/posts/a-simple-reference-data-trick/",
      "title": "A Trick to Help With Reference Data",
      "content_html": "<p>Nearly all enterprise systems have a concept of reference data. From website\nconfiguration, lookup tables, ID-to-ID conversions or domain-specific data, reference data is extremely prevalent and can\ntake many different forms. For years I made the same mistake over and over in managing this reference data. Let's have\na look at this common reference data pitfall, why it's so easy to fall into, and finally a nice trick to keep\nreference data simple.</p>\n<h2>The mistake</h2>\n<p>A couple of years ago I worked on a data processing system for an internal product the company I worked for was\ndeveloping. This product, among other things, performed a series of derivations from submitted data. The most notable\nof these was deriving a county from a given postcode (in the UK).</p>\n<p>When initially given the requirement to do this lookup, I envisaged a whole reference data system. Counties in the UK are not\ncompletely static, and their boundaries change gradually over time. Also, new postcodes get added fairly\nfrequently. This meant the reference data would periodically need updating. My brain immediately jumped to a solution: there would be a tool or\nsystem that pulled reference data from the source (<a href=\"http://ons.gov.uk\">ons.gov.uk</a>); this reference data would be written into a database (this\ncould be a SQL database or a document store like DynamoDB. We could then simply query the database to perform any\nlookups we needed and updating the reference data would just be running a tool. Simple enough?</p>\n<p>Despite initially sounding simple, there's a fair amount of hidden complexity within a system like this though. First of\nall, we need to think about how a database will be provisioned and set up - it needs deploying somewhere with an\nappropriate amount of memory and storage. This should also be isolated from the internet but not from our application\nto prevent anyone with malicious intent from being able to access the database directly. We'd then need to consider\ndatabase Schemas, and how to handle migrations to setup or update these. We then need to consider database users, making\nsure we can update the reference data with sufficient write permissions, but that the application only connects with\nread-only permissions (for the principle of least privilege). Once we have users, we need to think about how to make the\napplication aware of the user without exposing credentials...</p>\n<p>The whole system rapidly becomes very complicated.</p>\n<h2>The solution</h2>\n<p>This overcomplicating is an easy trap to fall into, and especially easy as there doesn't appear to be a simple solution that\nfits our criteria. Where else could we store the reference data if not in a database? A file on\ndisk? This would still have many of the same problems as the database solution, plus loading the file contents for a\nsingle lookup would be amazingly inefficient. We could load it into memory and keep the lookups there while the application\nruns? This one is pretty close, but maintaining and updating the reference data is still unclear, and would be\na bit of overhead on startup.</p>\n<p>The solution is simple: <strong>treat reference data as part of your code</strong>.</p>\n<p>The trap that's easy to fall into is thinking that your reference data has to be a part of its own, separate\nsystem. This used to be true where reference data updates needed to be deployed and a slow software development life\ncycle meant applications would only get deployed every several months, or, in some extreme cases, once a year (as was\nthe case for one project I worked on). However, thanks to modern development practices such as Continuous Delivery, and\nthe reduced friction and risk through containerisation and infrastructure as code, deployments can now happen as\nfrequently as we like. In the case of Shamaazi, where I currently work, we often deploy our code several times per day\nand every single change usually marks its own deployment.</p>\n<p>As a result of this, the simplest thing to version, manage, and keep up to date with the code that is running, is to\nsimply commit the reference data as part of the code. This could be <code>YAML</code> files that are loaded as the application\nstarts, or, even simpler, simply converting the reference data into the language you use.\nThis has a twofold benefit: the application does not have <em>any</em> overhead in accessing reference data as we've removed all\nthe complexity around deploying, managing, migrating and accessing databases; but also, our reference data is now\nversion controlled and we can easily review changes and track them over time.</p>\n<p>You could argue that this would bloat your application, adding a significant amount of data or extra code that\nwould impact the application size. However, this argument would fail to accommodate how much complexity already\nexists in running any application. At Shamaazi, we use Go for its simplicity, fast build times and static linking.\nA compiled binary without any reference data comes in typically between 10 and 15M. Using the example of the UK\npostcodes from earlier, there are around 1.7 million postcodes in the UK. Each of these is mapped to a County name.\nAs a raw file, this seems pretty large - it's around 43M. Compressed, however, it's much smaller (~8M). Adding it to the\nGo source code results in a barely noticeable increase in the application size - and this is for a <em>massive</em> reference\ndata set. If the reference data set is 500,000 records (still really big), we see around a 3M difference in Go binary size.</p>\n<h2>In Conclusion</h2>\n<p>Reference data can be tricky to manage in a way that's easy to update and easy to manage. I've fallen victim to\noverengineering systems in the past to deal with reference data. Often the simplest solutions are best, and that seems\nto be the case here. Keeping reference data as part of your code doesn't have a significant impact on the code size, it\nallows reference data to be updated much more easily, and it removes an incredible amount of complexity from\ninfrastructure. This isn't a one-size-fits-all solution though. If reference data is updated as part of the system, then this\ndoes not work. However, for read-only reference data, this is a useful tool to add to your arsenal.</p>\n",
      "date_published": "2020-09-30T00:00:00+00:00"
    },{
      "id": "https://dgls.dev/posts/task-a-simple-automation-tool/",
      "url": "https://dgls.dev/posts/task-a-simple-automation-tool/",
      "title": "Task - An easy to use tool to simplify your build",
      "content_html": "<p>At Shamaazi we've been using a tool called <a href=\"https://taskfile.dev\"><code>task</code></a>. It's an incredibly powerful tool that can completely replace Makefiles (an old C build system), or complicated scripts, with a much simpler and arguably more powerful alternative. Outside of that, it's an incredibly useful organiser for all command-line related activities.</p>\n<p>At Shamaazi we have a monolithic codebase, containing 7 different UIs, hundreds of services and all our infrastructure provisioning. We use <code>task</code> to manage all of this, as well as performing housekeeping jobs such as deleting user data when requested or changing peoples contact addresses. We find it incredibly powerful for this as it's easy to read config, self-documenting nature, and ability to only run commands that need running all save us tonnes of time waiting for builds, searching for commands, or editing config. It's equally valuable on small codebases too.</p>\n<p>Let's have a quick explore of what <code>task</code> is, and what it's capable of.</p>\n<h2>Getting Started</h2>\n<p>The simplest way to install <code>task</code> is through an install script they provide.</p>\n<pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">curl</span> -sL https://taskfile.dev/install.sh <span class=\"token operator\">|</span> <span class=\"token function\">sh</span></code></pre>\n<p>However, there are a tonne of other methods to install it, such as through <code>brew</code>, <code>snap</code> or <code>scoop</code>. You can find them all <a href=\"https://taskfile.dev/#/installation\">here</a>.</p>\n<p>Once installed we can run <code>task --init</code> in a directory we want to issue commands from. This will create a simple <code>Taskfile.yml</code> file. This file is in YAML format - an incredibly popular human-readable file format. This <code>Taskfile.yml</code> file is used to define all the possible tasks we want to run. Initially, it just contains a <code>Hello, World!</code> example.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token comment\"># https://taskfile.dev</span><br><br><span class=\"token key atrule\">version</span><span class=\"token punctuation\">:</span> <span class=\"token string\">'3'</span><br><br><span class=\"token key atrule\">vars</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">GREETING</span><span class=\"token punctuation\">:</span> Hello<span class=\"token punctuation\">,</span> World<span class=\"token tag\">!</span><br><br><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">default</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"<span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.GREETING<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span></code></pre>\n<p>Running <code>task</code> (or <code>task default</code>) will run the <code>default</code> task defined above, printing <code>Hello, World!</code>. We can break down the file into some clear sections:</p>\n<ul>\n<li><code>version: '3'</code> - this defines the version of Taskfile to use. We don't need to pay too much attention, but this\nprevents and future releases from stopping your tasks from working.</li>\n<li><code>vars:</code> - this section defines any globally accessible variables we want to use. We can see a single variable,\n<code>GREETING</code> defined as the <code>Hello, World!</code>. These variables are really powerful, and can reference other variables,\nor can be derived entirely from the output of a command.</li>\n<li><code>tasks:</code> - this section is where the actual tasks are defined. At the moment we just have a single task called\n<code>default</code>. When this task is run, it will run the command <code>echo &quot;{{.GREETING}}&quot;</code>. The <code>silent: true</code> line simply prevents <code>task</code> from printing out the command that is being run.</li>\n</ul>\n<p>This serves a super quick introduction. But let's cover some of the more powerful features.</p>\n<h2>Variables</h2>\n<p>In the previous section, I mention that the GREETING variable could be derived from the output of a command. This is sometimes incredibly useful for deriving information that isn't immediately available.  For a quick example of this, let's change the <code>vars</code> section to the following:</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">vars</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">GREETING</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">sh</span><span class=\"token punctuation\">:</span> echo \"Hello<span class=\"token punctuation\">,</span> $(whoami)<span class=\"token tag\">!</span>\"</code></pre>\n<p>Running <code>task</code> now will output <code>Hello, dglsparsons!</code> (or whatever your username happens to be!). As it's executing a command, this could literally be anything. Let's use <code>wttr.in</code> to provide the weather (and using <a href=\"https://stedolan.github.io/jq/\">jq</a> to quickly make something of the output. We can then add this to a second task.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">vars</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">GREETING</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">sh</span><span class=\"token punctuation\">:</span> echo \"Hello<span class=\"token punctuation\">,</span> $(whoami)<span class=\"token tag\">!</span>\"<br>  <span class=\"token key atrule\">WEATHER</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">sh</span><span class=\"token punctuation\">:</span> curl <span class=\"token punctuation\">-</span>s wttr.in<span class=\"token punctuation\">?</span>format=j1 <span class=\"token punctuation\">|</span> jq <span class=\"token punctuation\">-</span>r .current_condition<span class=\"token punctuation\">[</span><span class=\"token number\">0</span><span class=\"token punctuation\">]</span>.weatherDesc<span class=\"token punctuation\">[</span><span class=\"token number\">0</span><span class=\"token punctuation\">]</span>.value<br><br><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">default</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"<span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.GREETING<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span><br>  <span class=\"token key atrule\">weather</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"There be <span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span></code></pre>\n<p>Running <code>task</code> now will still print out the same greeting. However, running <code>task weather</code> will print out something along the lines of:</p>\n<pre><code>There be Haze.\n</code></pre>\n<p>That was quick and easy. And now we've got that command saved for good, in a nice memorable location.</p>\n<h2>Documentation</h2>\n<p>So our tasks are useful, but they would be a lot more useful if they explained what they did. Let's add some short descriptions to them. This can be done through the <code>desc</code> key on each task.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">default</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Prints a greeting.<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"<span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.GREETING<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span><br>  <span class=\"token key atrule\">weather</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Prints out the current weather.<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"There be <span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span></code></pre>\n<p>We can now run <code>task -l</code> or <code>task --list</code> to show a handy summary of all the available tasks.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\">$ task <span class=\"token punctuation\">-</span><span class=\"token punctuation\">-</span>list<br><span class=\"token key atrule\">task</span><span class=\"token punctuation\">:</span> <span class=\"token key atrule\">Available tasks for this project</span><span class=\"token punctuation\">:</span><br>* default<span class=\"token punctuation\">:</span> \tPrints a greeting.<br>* weather<span class=\"token punctuation\">:</span> \tPrints out the current weather.</code></pre>\n<p>This makes the tasks much easier to remember in the future!</p>\n<h2>Dependencies</h2>\n<p>Rather than going and downloading a weather forecast every single we want to check, let's create a task to write the weather forecast into a file.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">vars</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">GREETING</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">sh</span><span class=\"token punctuation\">:</span> echo \"Hello<span class=\"token punctuation\">,</span> $(whoami)<span class=\"token tag\">!</span>\"<br>  <span class=\"token key atrule\">WEATHER_FILE</span><span class=\"token punctuation\">:</span> weather.json<br><br><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">default</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Prints a greeting.<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"<span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.GREETING<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span>\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span><br>  <span class=\"token key atrule\">download-weather</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Downloads a weather forecast into a file<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> curl <span class=\"token punctuation\">-</span>s wttr.in<span class=\"token punctuation\">?</span>format=j1 <span class=\"token punctuation\">></span> <span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER_FILE<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span></code></pre>\n<p>This is a good start, but running <code>download-weather</code> will always download the forecast. If we were using some file as an input, you could set this as a <code>source</code>, even with a wildcard. This is incredibly useful for building code only when required. e.g.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">build</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> go build .<br>    <span class=\"token key atrule\">sources</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> ./<span class=\"token important\">*.go</span></code></pre>\n<p>This will only run <code>go build</code> if any <code>.go</code> files have been updated. For our purposes though, we don't have input files. Instead, we can use the <code>status</code> field to check programatically.</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\">  <span class=\"token key atrule\">download-weather</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Downloads a weather forecast into a file<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> curl <span class=\"token punctuation\">-</span>s wttr.in<span class=\"token punctuation\">?</span>format=j1 <span class=\"token punctuation\">></span> <span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER_FILE<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span><br>    <span class=\"token key atrule\">status</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>f ./<span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER_FILE<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span></code></pre>\n<p>Running <code>task download-weather</code> multiple times will result in the file being downloaded the first time, but not subsequently. Instead, a message is produced: <code>task: Task &quot;download-weather&quot; is up to date</code>.</p>\n<p>Let's go one step further and make our previous <code>weather</code> task depend on the weather file being downloaded. This can be done easily through a <code>deps</code> field. This means running the <code>weather</code> command would attempt to run <code>download-weather</code>. download-weather, in turn, will download the weather into a file, but, only if the file isn't already present... This sounds a mouthful, but bear with me and you'll hopefully see the value in this!</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\">  <span class=\"token key atrule\">weather</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Prints out the current weather.<br>    <span class=\"token key atrule\">deps</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> download<span class=\"token punctuation\">-</span>weather<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> echo \"There be $(cat <span class=\"token punctuation\">{</span><span class=\"token punctuation\">{</span>.WEATHER_FILE<span class=\"token punctuation\">}</span><span class=\"token punctuation\">}</span> <span class=\"token punctuation\">|</span> jq <span class=\"token punctuation\">-</span>r .current_condition<span class=\"token punctuation\">[</span><span class=\"token number\">0</span><span class=\"token punctuation\">]</span>.weatherDesc<span class=\"token punctuation\">[</span><span class=\"token number\">0</span><span class=\"token punctuation\">]</span>.value)\"<br>    <span class=\"token key atrule\">silent</span><span class=\"token punctuation\">:</span> <span class=\"token boolean important\">true</span></code></pre>\n<p>Running <code>task weather</code> will produce the following output if there is weather to download:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">task: <span class=\"token function\">curl</span> -s wttr.in?format<span class=\"token operator\">=</span>j1 <span class=\"token operator\">></span> weather.json<br>There be Haze</code></pre>\n<p>However, running it again will not download anything, and just print the value of the weather out:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">task: Task <span class=\"token string\">\"download-weather\"</span> is up to <span class=\"token function\">date</span><br>There be Haze</code></pre>\n<p>We can now hopefully see the value in this! We only do work if we have to, and each task can easily check if it has work to do. This can be incredibly useful for software development. For example, we could create a <code>deploy</code> task that depends on a <code>build</code> task. The <code>build</code> task will only build if the code has been updated since the last <code>build</code>. We can even make the <code>deploy</code> only perform an actual deployment if the built files are newer than the last deployment.</p>\n<h2>A Real World Example</h2>\n<p>So far we've looked at a rather contrived example using <code>curl</code> to download a weather forecast. Instead, let's look at a common code example of building a javascript project. We can define the desired behaviour as follows:</p>\n<ul>\n<li>running <code>task build</code> should run <code>npm run build</code>.</li>\n<li><code>npm run build</code> should only be run if there are any new changes to our source files since the last build.</li>\n<li><code>npm run build</code> should only be run if the latest <code>node_modules</code> are installed.</li>\n<li>the latest <code>node_modules</code> should be installed only if there have been changes to our packages since the last install.</li>\n</ul>\n<p>These three conditions can be checked using the magical <code>test</code> and <code>find</code> tools. <code>test</code> can be used to check if an output of a command returns some content (using <code>test -z</code>). It is also capable of checking whether files exist using <code>test -f</code>, and whether directories exist using <code>test -d</code>. If a file/directory doesn't exist, or a command returned some output, then the process will exit with a status code, indicating the command failed. Finally, <code>find</code> can be used along with the\n<code>-newer</code> flag to find files that are newer than our output.</p>\n<p>Our Taskfile.yml could look like the following:</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token comment\"># https://taskfile.dev</span><br><span class=\"token key atrule\">version</span><span class=\"token punctuation\">:</span> <span class=\"token string\">'3'</span><br><span class=\"token key atrule\">output</span><span class=\"token punctuation\">:</span> prefixed<br><span class=\"token key atrule\">tasks</span><span class=\"token punctuation\">:</span><br>  <span class=\"token key atrule\">build</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Build all static artifacts into build<br>    <span class=\"token key atrule\">deps</span><span class=\"token punctuation\">:</span> <span class=\"token punctuation\">[</span> node_modules <span class=\"token punctuation\">]</span><br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> npm run build<br>    <span class=\"token key atrule\">status</span><span class=\"token punctuation\">:</span><br>      <span class=\"token comment\"># Lets check that our output directory exists</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>d build<br>      <span class=\"token comment\"># And that our index.html file exists</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>f build/index.html<br>      <span class=\"token comment\"># Finally, check if there are any files in `src`, `public` or `node_modules` that are newer than</span><br>      <span class=\"token comment\"># out build/index.html output.</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>z \"$(find src public node_modules <span class=\"token punctuation\">-</span>type f <span class=\"token punctuation\">-</span>newer build/index.html)\"<br>  <span class=\"token key atrule\">node_modules</span><span class=\"token punctuation\">:</span><br>    <span class=\"token key atrule\">desc</span><span class=\"token punctuation\">:</span> Install all dependencies<br>    <span class=\"token key atrule\">cmds</span><span class=\"token punctuation\">:</span><br>      <span class=\"token punctuation\">-</span> npm ci<br>    <span class=\"token key atrule\">status</span><span class=\"token punctuation\">:</span><br>      <span class=\"token comment\"># Lets check that node_modules exists</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>d node_modules<br>      <span class=\"token comment\"># Finally, we are up to date if any files in node_modules are newer than package.json</span><br>      <span class=\"token punctuation\">-</span> test <span class=\"token punctuation\">-</span>n \"$(find node_modules/ <span class=\"token punctuation\">-</span>type f <span class=\"token punctuation\">-</span>newer package.json)\"</code></pre>\n<p>Finally, let's test this out. The first run of <code>task build</code> will do the following:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">$ task build<br>task: <span class=\"token function\">npm</span> ci<br><span class=\"token operator\">></span> core-js@2.6.11 postinstall <span class=\"token punctuation\">..</span>.<br><span class=\"token punctuation\">..</span>.<br>task: <span class=\"token function\">npm</span> run build<br><span class=\"token operator\">></span> some_project@1.0.0 build <span class=\"token punctuation\">..</span>.<br><span class=\"token punctuation\">..</span>.</code></pre>\n<p>On a second run the following happens though:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">$ task build<br>task: Task <span class=\"token string\">\"node_modules\"</span> is up to <span class=\"token function\">date</span><br>task: Task <span class=\"token string\">\"build\"</span> is up to <span class=\"token function\">date</span></code></pre>\n<p>Any changes to <code>package.json</code> will result in the dependencies being installed again and then the build being rerun.  Any change to any <code>src/</code> files will result in just the build being rerun. This can save a lot of time as builds are run over and over again.</p>\n<h2>Conclusion</h2>\n<p>Through this short guide, we've built a very clever, but easy to read and follow, set of tasks. These tasks are capable of documenting themselves allowing them to be easily read and understood. Additionally, the <code>status</code> and <code>sources</code> fields can be used to create tasks that only perform actions when they need to. We can chain these tasks together through the <code>deps</code> field. Chaining tasks in this manner can easily optimize a previously difficult task by breaking it into component parts and skipping any parts that do not need to be executed. We've seen this through two different examples - a contrived weather downloader and a more typical npm project. Through these examples, we've highlighted the power and convenience that <code>task</code> can provide. Anyone can easily benefit from using it, and hopefully, you can see why we love it at Shamaazi.</p>\n",
      "date_published": "2020-09-25T00:00:00+00:00"
    },{
      "id": "https://dgls.dev/posts/on-testing/",
      "url": "https://dgls.dev/posts/on-testing/",
      "title": "You should only write USEFUL tests",
      "content_html": "<p>Through my career in software I've come across a broad range of attitudes and opinions towards testing code. The two\nextremes being that 'tests aren't worth writing because something is too complicated', or that\n'every single piece of code being checked in should be accompanied by tests'. Of\nthese two contrasting opinions the latter, although not always in such an extreme form, is much more prevalent.\nHere, I will argue three cases why we don't always need to test code: the obvious correctness isolated pieces of code can\nhave; the redundancy badly coupled tests can experience when refactoring; and the often immutability of\nbusiness-critical code. Instead, I believe that we should be carefully considering where tests truly are required before implementing any.</p>\n<p><img src=\"https://miro.medium.com/max/480/1*6GgUsO9PL5nBpJi6RROcOg.jpeg\" alt=\"Your tests are bad and you should feel bad\"></p>\n<h2>The Obvious</h2>\n<p>If you have ever taken a tutorial, watched a course, or read a book on unit testing, you have probably seen an example\nthat tests a piece of code along the lines of the following:</p>\n<pre class=\"language-go\"><code class=\"language-go\"><span class=\"token keyword\">func</span> <span class=\"token function\">Sum</span><span class=\"token punctuation\">(</span>x <span class=\"token builtin\">int</span><span class=\"token punctuation\">,</span> y <span class=\"token builtin\">int</span><span class=\"token punctuation\">)</span> <span class=\"token builtin\">int</span> <span class=\"token punctuation\">{</span><br>    <span class=\"token keyword\">return</span> x <span class=\"token operator\">+</span> y<span class=\"token punctuation\">;</span><br><span class=\"token punctuation\">}</span></code></pre>\n<p>No doubt you'll then go on to be shown exactly how you'd write a test that checks a variety of inputs to make sure the\n<code>Sum</code> function produces the right results for every possible case you can think of.</p>\n<p>What these tutorials all fail to consider though, is whether the function requires a test in the first place. Having a\nlook at the above example, do you think there's any possibility it's not doing what it claims to be? Could it be\nexpressed in a simpler way? Is it hard to wrap your head around? The answer to all three of these questions is\n(hopefully) no. This illustrates how code can be intuitively correct at a glance, without the need for extensive proof\nor testing. Sir Tony Hoare, a hugely influential computer scientist, infamously said the following:</p>\n<blockquote>\n<p>“There are two ways of constructing a piece of software: One is to make it so simple that there are obviously no\nerrors, and the other is to make it so complicated that there are no obvious errors.”</p>\n</blockquote>\n<p>This piece of rhetoric fits in perfectly with the questions we asked of the <code>Sum</code> example. In practice we can see that\ntests are only really needed when something is 'so complicated that there are no obvious errors'. These tests would then\nprove value by showing that these non-obvious errors don't exist. So for simple, 'obviously' correct code, is there any\nneed to add tests? Instead, before adding tests, you should ask the question: 'Is this code obviously correct, or can I change\nit make it obviously correct?'. If the answer to this question is yes, then there is no need to test what is obvious.</p>\n<h2>The Coupled</h2>\n<p>When deciding on what level of tests to write for a system (unit / service / ui / integration / end-to-end, or various\nother names), the <a href=\"https://martinfowler.com/bliki/TestPyramid.html\">'Testing Pyramid'</a> immediately springs to mind.\nIf you haven't seen the idea before, it suggests that we do the majority of our testing at the individual 'unit' level,\nThis unit level results in tests are fast to run and can quickly, cheaply and efficiently provide a high level of code\ncoverage. We should then provide higher level tests in a much sparser manner, relying on\nthese to effectively prove that everything is wired up and communicating properly, rather than for checking individual\nbranches in logic.</p>\n<p><img src=\"https://martinfowler.com/bliki/images/testPyramid/test-pyramid.png\" alt=\"The Testing Pyramid\"></p>\n<p>This system is straightforward and initially makes complete sense. It is also the commonly accepted practice. However, it\nfails to acknowledge that the disposability of code, or the ability to refactor can be a major consideration in what tests\nto write and how to write them. Any system undergoing continual work will see units, or isolated pieces of code appear,\ndisappear, and take completely different forms over time. This is the natural progress and evolution of working, living\nsoftware. To emphasise this point, I ask 'have you ever refactored a section of a codebase, to find that existing unit\ntests are made completely irrelevant or redundant?'. If so, this shows that the initial tests were overly coupled to the\nlayout and structure of the code. Remember that tests are simply more code that agrees with the initial code you just wrote\n(or if performing TDD, they are simply more code that agrees with the code you are about to write).</p>\n<p>In areas of code that are rapidly and constantly changing in structure, higher level tests provide a greater level of\nmaintainability and stability, as the higher-level workings of a system are typically more stable.\nThese tests are significantly less likely to be made completely redundant.</p>\n<p><img src=\"/img/remote/titanic-tests.png\" alt=\"Titanic Sinking\"></p>\n<p>This, however, poses an interesting conundrum: how do we know when code\nis likely to change in structure or approach in the future? If we could identify these areas ahead of time, then our\nnewfound prescience could simply mean we write them in a better form the first time around. Sadly, however, we are left fumbling in the\ndark: attempts at organising code are a 'best efforts' approach given a current state of knowledge.</p>\n<p>We do, however,\nget an increased understanding of a system the longer it exists, or the longer we work on it. This allows informed\ndecisions about what testing is fully appropriate. Young systems, or systems with a high degree of uncertainty benefit\nthe most from high-level 'black-box' style testing, as these are the most likely to undergo structural change over time.\nThese tests are much less likely to risk redundancy.\nContrastingly older, more stable, or better understood systems benefit more from the flexibility and efficient coverage\nthat unit testing can provide.</p>\n<p>Overall, the age, stability and uncertainty of a system need to underpin what tests we\nwrite: the testing pyramid provides an oversimplified view of the world, but a useful tool to consider. However, we need\nto supplement this with our understanding of code and its evolution over time, asking 'how long will these tests be\nrelevant for?' or 'are these likely to be irrelevant in X months/years time?'.</p>\n<h2>The Immobile</h2>\n<p>On many of the large scale software projects I have worked on, a rather interesting irony has been present: the most\nimportant, business critical pieces of code are often the most insufficiently tested. Their outputs lack clear\ndefinition and seemingly any small change could spell disaster. Yet however, they remain this way.</p>\n<p><img src=\"/img/remote/immobile.webp\" alt=\"Unmoveable rock\"></p>\n<p>Several years ago I\nworked on a NHS project. This was, to massively oversimplify, an incredibly complicated and fundamental system responsible\nfor associating prices with hospital treatments and generating reports based on these prices. The report system was well\ntested, with thousands of tests meticulously checking every single possible output for a massive variety of inputs. Despite\nall this, the core of the project, the pricing system, was almost entirely lacking in tests. It was only\ntruly tested as a side-effect in testing the reports. The code was incredibly hard to work with and was not amenable to\ntesting, and so it never was. At the time I didn't understand how it could be left that way when it was such a\nfundamental part of the system.</p>\n<p>I've later realised the rationale is incredibly simple. The original code was written as a proof of\nconcept. It worked, and as a result became the production code. Nobody wanted to make any changes for fear of causing an\nunknown regression that could be incredibly difficult and costly to track down and fix. Similarly the process for assigning a\nprice was a fixed piece of logic: it didn't change over time, no new requirements changed how it worked, and nobody\nreally needed to know how it worked internally - just that it did. The cost of not having any tests, even for such an\nimportant piece of code, was massively outweighed by the risk in changing the code to make it testable and the effort in\ntesting it.</p>\n<p>Am I advocating not testing crucial business systems here? No - not at all! However it's important to recognise that we\ndon't live in a perfect world. Systems missing tests for crucial parts exist <em>everywhere</em>, and are far more prevalent\nthan I'd like to admit. However, this isn't the catastrophe younger me thought it was. If a piece of code is complicated,\nbut it works and never changes, then does it matter if it is poorly tested? Adding tests when making changes however,\nwould still be prudent - but we can still ask the question: 'does the benefit of testing this piece of code outweigh the\ndifficulty of adding tests?'. It's a dangerous question to ask, and the answer is almost exclusively 'yes - add the\ntests'. But just maybe, sometimes, it's a worthy thing to consider.</p>\n<h2>To Conclude</h2>\n<p>The approach to creating well-designed test suites that provide continual value throughout the lifecycle of a project is\na difficult task. Advocates of a 'testing pyramid' approach oversimplify the matter. While the intention is good, it\nfails to root itself in the practicality of the ever-changing world of software development: the evolution of code over\ntime can easily render tests redundant or unnecessary, and at times those tests can even be a barrier to refactoring. The\n'obvious' nature clean code can possess also reduces the need for tests as a proof of correct behaviour. Similarly, a\nsimple cost-benefit analysis should be considered when regarding existing code that is known to be correct and is unchanging,\nor changing very infrequently. Not all tests are worth writing. Not everything has to be tested, and that is fine.</p>\n",
      "date_published": "2020-09-18T00:00:00+00:00"
    }
  ]
}
